{"text":"how the hell do you light charcoal without lighter fluid?","meta":{"section":"Cooking","utc":1452885406}}
{"text":"Check out the spicy silken tofu Korean soups called soondubu-jigae. They're awesome. There is a seafood version, a beef version, and other variations as well.","meta":{"section":"Cooking","utc":1551369750}}
{"text":"1 part Fish sauce, 2 part soy sauce, 1 part Shoaxing cooking wine.","meta":{"section":"Cooking","utc":1530733372}}
{"text":"Go on...","meta":{"section":"Cooking","utc":"1421780321"}}
{"text":"I can't believe that frozen concentrated orange juice isn't a bargain!","meta":{"section":"Cooking","utc":"1391333592"}}
{"text":"Do you have any specific recommendations for a good food processor? Right now I have...knives, which is great, but sometimes overly time consuming.","meta":{"section":"Cooking","utc":1488216507}}
{"text":"Reddit is now EVERYTHING!","meta":{"section":"Cooking","utc":"1400878925"}}
{"text":"I have the Kuhn Rikon peeler. It is excellent!","meta":{"section":"Cooking","utc":"1409455861"}}
{"text":"I cooked Johnsonville Italian sausage on low for almot an hour. Cooled split and sliced into half moons. Fried again with minced onion and spinach. Strained and blotted. I used a jar of pizza sauce. 14oz. 12in cast iron.","meta":{"section":"Cooking","utc":1557705117}}
{"text":"https://www.vietworldkitchen.com/blog/category/essentials-pho Andrea Nguyen is one of the leading publicists in the cuisine. Her blog is full of awesome tips, tricks and recipes.","meta":{"section":"Cooking","utc":1543957127}}
{"text":"Hello Daniel, How are you thinking schedule wise? Cause with a busy schedule I'm imagining you'd be streaming anywhere from 1-3 days of the week cause it takes a lot of energy to put on a show as well by yourself. Also what everyone else has touched on, content. If you have demands and a list of dishes you want to do each stream (each streaming being 1 dish at a minimal basis), it wouldn't be a bad idea. Cause a 3-4 hour typical stream would require a lot of energy but having an established schedule with a consistent starting time, a 40minute to an hour and a half making simple home ingredient or spiced up refined dishes would be a good start. Depends on your schedule too which I'm sure you more than myself have considered without me telling you :D. Under the 'Creative' category of Twitch, there's a large variety of what people stream (varying from forging metal, carving wood, digital paintings, etc.) and personally for me its just the chill environment that the broadcaster can put on that makes it worth watching, not so much the content priority wise at first. As some have already mentioned, if you are able to be entertaining by yourself for a period of time, the content will only be a bonus added on top. But I think by your statements, the act of sharing your ideas and knowledge to others will be a great way for you to rekindle that enthusiasm, and it will show it to the viewers. I love cooking and I would love to see a variety of dishes ranging technicality wise and also touching on your home roots of cultural palettes. I don't see too many cooking streamers (I use twitch) so this is something I would be down provided the broadcaster (you) can establish that chill learning environment :) it sure as hell not gonna be easy, cause with cooking I imagine you would need some production value which doesn't come cheap. Simple camera or multiple (for angles), some extra lightning (if the room lightning isn't sufficient), a mic, but that's just me with my standards of production value. You can get a lot done with a webcam and its built in mic so don't worry too much on that at first, sorry. Content comes first, then the production value and consistency of the stream. 1 final note is that establishing yourself as a streamer from the get go is gonna be hard at first because its something you have to be consistent with. A good idea is to archive it online like on Youtube and redirect them to your streams. Or even both, or just one. Both platforms have their pros and cons but streaming at the start is going to be tough. If you can get the snowball effect going, all to ya :)","meta":{"section":"Cooking","utc":1449183956}}
{"text":"It's also good as a glaze on meat--I would say go with something like chicken or pork. You can do a sweet and sour sauce for pork meatballs, too--that's really good. It's a good sandwich topping, it's good with baked brie, it's great in smoothies. Also, I've swirled it into lemon cornmeal muffins or orange tea bread and it always works well.","meta":{"section":"Cooking","utc":1511625128}}
{"text":"Thanks for your reply! I mostly use my microwave to reheat as well. I find defrosting to be a bit iffy as I've defrosted meats that stayed icy in the middle and the exterior had changed color (aka cooked), it was kinda weird haha! I'm thinking mainly about baking recipes actually! Like how would a normal cake recipe turn out in a microwave, and if it turns out poorly, how can it be adapted to / optimized for microwave cooking! How does microwave cooking for rice work though? I have a mini rice cooker for my rice so I've never tried, but it feels like it wouldn't cook through in the microwave if my rice cooker takes so long to cook rice normally!","meta":{"section":"Cooking","utc":1478957911}}
{"text":"If it’s not safe, I should be dead","meta":{"section":"Cooking","utc":1519439269}}
{"text":"I don't have any of the actual measured kitchen cups...would a normal mug work? :/","meta":{"section":"Cooking","utc":"1349176136"}}
{"text":"If you like fish, I'd recommend this recipe: http://www.eatingwell.com/recipes/ginger_steamed_fish_with_troys_hana_style_sauce.html. I recently made it with my SO. It was pretty easy, and we loved it. Instead of bass, we went with cod. You don't need a bamboo steamer. I used a metal steamer that I already had for steaming veggies. You can find one on Amazon. I highly recommend it as a kitchen essential. http://www.amazon.com/Norpro-175-Stainless-Vegetable-Steamer/dp/B001FBCP7O/","meta":{"section":"Cooking","utc":"1416278480"}}
{"text":"Cioppino with a couple pieces of toasted sourdough.","meta":{"section":"Cooking","utc":1517516288}}
{"text":"Holy crow that looks delicious. You're an inspiration to my breakfast tomorrow!","meta":{"section":"Cooking","utc":"1328074522"}}
{"text":"My family makes what we have always called pot pie. Although it is actually more a ham and potato stew with flat dumplings. It is great and when new people eat it they are always confused because they expected pot pie","meta":{"section":"Cooking","utc":1507911409}}
{"text":"It is worth it. However, you don't need to pay out the butt for a Le Creuset. It is my go to for cooking soups and stews. It's so nice. Also casseroles. It's not just a pot for braising meat.","meta":{"section":"Cooking","utc":1533219783}}
{"text":"If you have a cast iron skillet, and the bacon isnt super thin, preheat oven at 500, warm pan in oven, coat the bacon wrapped asparagus in olive, coat the pan in olive oil, bake for about 12-15 mins, watch them, and flipped when the bacon begins to turn reddish on top(less then half way through). Oh and keep watch that they arent sticking.","meta":{"section":"Cooking","utc":"1422696225"}}
{"text":"Completely and utterly agree. And SO versatile - I think I remember Julia Child saying the French had something like 2,000 potato recipes and she'd just shown us 3 :). Love Julia Child - what an absolute legend she was.","meta":{"section":"Cooking","utc":1551635249}}
{"text":"She'll often say that you can substitute some of the harder-to-find ingredients with what you can find locally. Like using honey or corn syrup instead of Korean rice syrup. Or when I couldn't find Asian chives, I just used green onion instead. Do yourself a favor and make this garlic and leek chicken. All of the ingredients can be found at any mega-mart grocery store, except maybe the potato starch which could be substituted for with tapioca or corn starch.","meta":{"section":"Cooking","utc":1480702056}}
{"text":"I always just open up my hand toward the end if it’s set to fairly small slice. It doesn’t really have a good angle of attack to fuck up your palm.","meta":{"section":"Cooking","utc":1553087194}}
{"text":"This video looks pretty helpful too https://youtu.be/fYCCw_KN-J4","meta":{"section":"Cooking","utc":1557509809}}
{"text":"It's not safe to go alone...take this: http://www.amazon.com/Spam-Cookbook-Marguerite-Patten/dp/0600620476/ref=sr_1_1?ie=UTF8&amp;qid=1424817332&amp;sr=8-1&amp;keywords=spam+cookbook","meta":{"section":"Cooking","utc":"1424817366"}}
{"text":"I was cleaning chicken. Shit you not. Just cleaning chicken.","meta":{"section":"Cooking","utc":1456868978}}
{"text":"http://rouxbe.com/recipes/4830-creamy-mac-n-cheese havent made this one specifically but rouxbe has never done me wrong before def need less milk, needs other spices too though","meta":{"section":"Cooking","utc":1474705100}}
{"text":"We did this at Outback! Told him that the air gets smelly and old and it affects the quality of the food.","meta":{"section":"Cooking","utc":1560828460}}
{"text":"Start pickling stuff. You can clean with it too, if I don't have lemon juice in the restaurant I use some apple cider vinegar to clean the flattop grill","meta":{"section":"Cooking","utc":1527869838}}
{"text":"You came here with an unpopular (and arguably unsafe) opinion, and it seems like you just wanna argue with people who don't share it.","meta":{"section":"Cooking","utc":1531738514}}
{"text":"Not by anything like a significant amount though.","meta":{"section":"Cooking","utc":"1344253188"}}
{"text":"This one is great: http://www.jamieoliver.com/recipes/pasta-recipes/the-best-pasta-salad/","meta":{"section":"Cooking","utc":1459420110}}
{"text":"I could be wrong about this... but ground mustard acts as an emulsifier in your roux/cheese sauce to help keep it from breaking.","meta":{"section":"Cooking","utc":1523036483}}
{"text":"Avocado toast","meta":{"section":"Cooking","utc":1563835738}}
{"text":"Salmon is not an economical fish to eat. Not where I live.","meta":{"section":"Cooking","utc":"1387120399"}}
{"text":"Yeah, I think I'll keep going to the bakery downstairs and buy it for <1 euro.","meta":{"section":"Cooking","utc":"1394354892"}}
{"text":"If you have a model number that would otherwise fall under the recall except it ends in Y, it's not recalled.","meta":{"section":"Cooking","utc":1481692270}}
{"text":"Thank you for posting a recipe, defiantly gonna try this out.","meta":{"section":"Cooking","utc":"1437354810"}}
{"text":"It needs to go in the freezer. Cooked meat may not kill you if you refrigerate it for 3 days, but to many people it will have that old meat flavor that is due to fatty acid breakdown.","meta":{"section":"Cooking","utc":1562819339}}
{"text":"the flower.","meta":{"section":"Cooking","utc":1471786256}}
{"text":"Well, they were a package for $60. I didn't sink too much into them.","meta":{"section":"Cooking","utc":1455774832}}
{"text":"The secret to great omelettes is to whisk it while it's cooking and to not overcook it (ideally it should finish on the plate). By whisking you get a nice smooth curd. This i the best video I've ever seem on making omelettes. Taragon omelettes are my favourite. http://www.youtube.com/watch?v=57afEWn-QDg","meta":{"section":"Cooking","utc":"1390937076"}}
{"text":"Cook some bacon and make an amazing BLT","meta":{"section":"Cooking","utc":1487283370}}
{"text":"It freezes well also.","meta":{"section":"Cooking","utc":1485124489}}
{"text":"This may sound like heresy but I don't really mind throwing a bit of it out. The bulk of the thing is neutral oil like vegetable or canola, which is dirt cheap to begin with. If you eat 3 servings of it, you've more or less gotten your money's worth out of the more expensive egg yolk, mustard, and lemon.","meta":{"section":"Cooking","utc":"1371760066"}}
{"text":"Wait. Wat. For advice, I would state firmly yet kindly that while it was, at first, no trouble for you to give her a ride, but It's starting to interfere with your daily routine and that It's really not great for you to have to constantly go out of your way to help her.","meta":{"section":"Cooking","utc":1520729766}}
{"text":"As a kid I loved fried bread spread with a thin layer of tomato ketchup and sprinkled with salt.","meta":{"section":"Cooking","utc":1546294014}}
{"text":"It's definitely hotter going in. You are just left with fewer options and more compromised when it comes out. It's a full 24-hour experience though.","meta":{"section":"Cooking","utc":1557698708}}
{"text":"Not OP but thanks for posting this. Have been looking for a easy stir fry sauce.","meta":{"section":"Cooking","utc":"1381737205"}}
{"text":"Yes!","meta":{"section":"Cooking","utc":1563818693}}
{"text":"If you want the best of both world's get the dough from a pizza place you like and then just put the toppings on. Super easy and still tastes like a homemade pizza.","meta":{"section":"Cooking","utc":1501008259}}
{"text":"I live in So Cal and have never heard of Farmer Boys.","meta":{"section":"Cooking","utc":"1374443607"}}
{"text":"poached in white wine","meta":{"section":"Cooking","utc":1556421369}}
{"text":"K, I'd go with SeriousEats.","meta":{"section":"Cooking","utc":"1387215897"}}
{"text":"Use a towel","meta":{"section":"Cooking","utc":"1353207945"}}
{"text":"I'd start with a teaspoon","meta":{"section":"Cooking","utc":1505437638}}
{"text":"You don't own a microwave? Really?","meta":{"section":"Cooking","utc":1555970446}}
{"text":"I do this except with some Dave's killer bread and I add cayenne pepper to the tops","meta":{"section":"Cooking","utc":"1443643615"}}
{"text":"plant them? Potato Gratin - sliced and layered potatoes, baked with a sauce and some other veg/meat. Smashed potatoes. Boil them, drain, add butter, salt, pepper, possibly garlic and whatever spices. Put lid on, hold lid on to pot, and shake it a bit. Works best with the skin on. Potato Latkes - leftover mashed potato, mixed with egg (possibly flour), salt/pepper, fry cakes of them.","meta":{"section":"Cooking","utc":"1443962595"}}
{"text":"Season it before first time using it too! It most likely been factory seasoned but it’s never a bad idea to do it before the first cook. Make some memories in that skillet sir, good luck!","meta":{"section":"Cooking","utc":1549772024}}
{"text":"mm yummy. I was thinking doing the gruyere with spinach, roasted red pepper and sauteed portobellas.","meta":{"section":"Cooking","utc":"1382559546"}}
{"text":"If you have good knives, get it done professionally if you don't know what you are doing.... I peckered up my favorite chef's knife because I didn't know what I was doing.","meta":{"section":"Cooking","utc":"1407328289"}}
{"text":"The Costcos by me have had san marzanos for years, in Cento 3 packs. I assumed that was system wide, since 3 different shops had them. Also, you could just use Roma tomatoes from your supermarket and a wee bit of sugar, and save like 70%.","meta":{"section":"Cooking","utc":1538793997}}
{"text":"When you cook/braise, stand up the pork belly fat side up. Make sure you fill the liquid up to the fat layer, but not submerge the fat in the braising liquid","meta":{"section":"Cooking","utc":1498358832}}
{"text":"Dumb.","meta":{"section":"Cooking","utc":"1339452590"}}
{"text":"This looks great, I might give it a try!","meta":{"section":"Cooking","utc":1478988764}}
{"text":"This somehow combined with mac and cheese would also be really tasty.","meta":{"section":"Cooking","utc":1479174935}}
{"text":"Ice cream is largely cream anyway, what's the difference? I have a Copycat Buster Bar recipe that uses that method. I put a few heavy grindings of salt in it and 2 tsps of vanilla (plus the 2 cups heavy cream, 14 oz sweetened condensed milk).","meta":{"section":"Cooking","utc":1517443776}}
{"text":"Taste (from an evolutionary perspective) is largely helpful for an organism to ascertain various chemical properties about the food they are ingesting. Sweetness is a reflection of the sugar content Sourness is a reflection of the pH Saltiness is a reflection of sodium content Bitterness is a large family of taste receptors (a few hundred) that generally react to naturally found toxins. Umami is a reflection of protein content (glutamate is an amino acid). You can see how together, these might give a species some evolutionary benefits to ingest foods that would help the animal to maintain proper levels of sugars, proteins, and ions while avoiding toxins.","meta":{"section":"Cooking","utc":"1426824175"}}
{"text":"If you don’t like Greek yogurt why are you trying to eat it. Try a different kind, like a heavily flavoured type.","meta":{"section":"Cooking","utc":1528111573}}
{"text":"No shit, I used to bring cold pizza wrapped in aluminum foil in to work and put the pieces on top of my monitor the second I got there. By the time break came, it was wonderfully warm, the cheese was warm, stretchy and wonderful, and I was in fucking heaven. I swear to this on my kid's lives!","meta":{"section":"Cooking","utc":1454208932}}
{"text":"Personally I think more importantly is to just have a sharp knife that you are comfortable holding/using. It just so happens that my expensive knives get and stay sharper.","meta":{"section":"Cooking","utc":1496218438}}
{"text":"Some thing like these: http://www.hamiltonbeach.com/programmable-slow-cookers.html","meta":{"section":"Cooking","utc":"1416028188"}}
{"text":"There wasn't a better place to feed the hungry than a university?","meta":{"section":"Cooking","utc":"1336656073"}}
{"text":"That was good read, beautifully written.","meta":{"section":"Cooking","utc":1530510486}}
{"text":"Mine's pretty much the same except the icemaker is in the freezer, not the door. I like the extra door space.","meta":{"section":"Cooking","utc":"1390165591"}}
{"text":"My SO and I have been experimenting for a while with pizza recipes and now I think we have the perfect one. Here's what we found makes an awesome pie: 1. crust. Find a recipe that requires multiple folding and resting cycles (2 or 3). I've tried those recipes that only need an hour to rise and then go right into the oven and it just doesn't allow enough time for flavor to develop. Our usual recipe takes 12 hours total but a lot of that is wait time so it's not so bad 2. sauce. 1 can san marzano tomatoes, salt, pepper, olive oil, basil (optional). just crush it all together. Drain tomatoes first for chunky sauce. Simple and delicious and so easy. 3. cheese. I like a mixture of mozz, parmesean, and asiago. Mozz is a super mild flavor so experiment with mixing some other cheeses with it. 4. some people have also mentioned higher temperature. We use 550 bc it's the highest our oven will go. If your oven doesn't get hot enough (or even if it does) you can broil it for the last 2 minutes of baking to get the cheese to brown slightly which is super yummy Good luck on your pizza endeavor!","meta":{"section":"Cooking","utc":1459348925}}
{"text":"Well, succotash you can do with one skillet, for the chicken and sweet potato all you'll need is an oven, a roasting tray (I usually rig one out of a steamer rack and a baking tray lined with tinfoil), and tinfoil to wrap the sweet potatoes in.","meta":{"section":"Cooking","utc":"1421768627"}}
{"text":"Pick a good tool for making the layout. If you know how to use it, I'd suggest Latex, but others like word should be able to make something decent as well. Pick a nice font. Get nice paper to print on. Also I'd rather go for a smaller menu: about 5 appetizers, 2 main dishes and 3 desserts. (Then if you have more ideas, make multiple menus instead of a large one) Will I be able to order an Elsweyr fondue? ^^","meta":{"section":"Cooking","utc":1480639994}}
{"text":"Yeah. 2:1 water:rice, bring to boil, stir, cover, simmer, wait until done.","meta":{"section":"Cooking","utc":"1359332529"}}
{"text":"That's awesome. Thanks for the response. Have you ever tried cooking this recipe in a crockpot?","meta":{"section":"Cooking","utc":"1392759913"}}
{"text":"Should anyone be interested to actually make chipotle en adobo, this is a very easy recipe I have done many time now to great success. https://cookingasprocrastination.wordpress.com/2011/10/03/how-to-make-your-own-ridiculously-easy-chipotle-en-adobo/","meta":{"section":"Cooking","utc":"1426502059"}}
{"text":"Ever had beer brats? Boil bratwurst in beer and then come and talk to me. You'll thank me.","meta":{"section":"Cooking","utc":"1410796611"}}
{"text":"Never occurred to me that there is a specific type to be used. I always use cold smoked salmon from any decent brand and find it very similar to what I get from restaurants.","meta":{"section":"Cooking","utc":"1442343977"}}
{"text":"This is reddit. People still upvote 100 duck sized jokes. I'm sure they'll be some good questions, just buried under the traditional circle jerk posts at the top.","meta":{"section":"Cooking","utc":"1429301116"}}
{"text":"Probably! Try it out :)","meta":{"section":"Cooking","utc":"1428868645"}}
{"text":"You may be able to fix it so the landlord doesn't know. http://www.dummies.com/how-to/content/fixing-holes-in-carpets.html","meta":{"section":"Cooking","utc":"1358907802"}}
{"text":"Use home made ghee and use a lot.","meta":{"section":"Cooking","utc":1526382366}}
{"text":"Tuna salad sandwich with chips and pickles. Always reminds me of when not I would stay home sick as a kid. Makes me feel like my mom's taking care of me.","meta":{"section":"Cooking","utc":1473644271}}
{"text":"I agree 100% - thin (and crispy) crust pizza is amazing. The best I've had was in Hawaii - at 'Flat Breads' (it's a chain I think). You can make the same thing - it's easier if you use something like Naan bread to start. I fry my chicken first, add everything to the 'pizza', and then put it in the oven for the final 'crispiness'. I also use oil instead of tomato sauce. Try this: http://www.college-cooking.com/2013/02/24/cast-iron-skillet-pizza/","meta":{"section":"Cooking","utc":"1362321687"}}
{"text":"Thank you! I got a rice cooker and I've been having trouble making good rice, esp sushi rice","meta":{"section":"Cooking","utc":"1374984231"}}
{"text":"Your problem is solved. I count 5 at least at Amazon. $12 minimum.","meta":{"section":"Cooking","utc":1554646932}}
{"text":"I put jelly or jam on toast, then put the egg on that. Get a nice, gooey, sweet and savory delight.","meta":{"section":"Cooking","utc":1560260364}}
{"text":"Cheeks. Considered a great cut my many, like cows cheeks. Great for long, slow cooking.","meta":{"section":"Cooking","utc":"1377182529"}}
{"text":"It sounds like your emulsion is breaking. Before, it was helped along by the stabilizers. The good news is that your use of Hellman's mayo should have sufficient stabilizers in it to help you. When you mix the mayo and the sour cream, how do you do it? Are you just mixing them with a spoon? I would try a food processor or a stick blender at the very least. Maybe add the blue cheese at the end if you want to maintain the chunky texture.","meta":{"section":"Cooking","utc":"1370875029"}}
{"text":"If they burst due to steam build up inside the casing, then fat comes out but if they don't burst, they will retain more fat. I have a convection oven and if you don't, I would go to 350F. Some recipes say 400F, which will be faster, but I think they may be more likely to burst cooking them at a higher temp.","meta":{"section":"Cooking","utc":1561932155}}
{"text":"Or give it some french toast treatment.","meta":{"section":"Cooking","utc":"1355852922"}}
{"text":"homemade jerky is so dang good","meta":{"section":"Cooking","utc":1518638639}}
{"text":"That's the first thing I made when I got her book. So simple. So delicious.","meta":{"section":"Cooking","utc":"1380580707"}}
{"text":"I'm really talking about the magazines. The online stuff is one thing.","meta":{"section":"Cooking","utc":"1431546522"}}
{"text":"Some knife companies I believe have lifetime sharpening guarantees. Mostly because nobody follows through with those offers. You could practice on a cheaper knife first and see how you do and if it seems too hard there are companies that you can pay to sharpen them. I'm a big try it yourself before you pay someone else kinda person though,","meta":{"section":"Cooking","utc":"1330457604"}}
{"text":"The sad thing is that I even Googled it to make sure that I had \"Mise\" spelled right.","meta":{"section":"Cooking","utc":1544117134}}
{"text":"Eggs Benedict but with the smoked salmon instead. Sliced tomato and capers on top!","meta":{"section":"Cooking","utc":"1418994229"}}
{"text":"You gonna, uh, share with those of us who don't know, what jolof rice is?","meta":{"section":"Cooking","utc":1529419593}}
{"text":"Takoyaki are fantastic. There's a korean grocer near me that sells bulldog sauce, which is a requirement, but if you don't have a local asian grocer you can find it on amazon","meta":{"section":"Cooking","utc":"1386263299"}}
{"text":"Are you sure that's what he uses specifically? I know he has his own line, but can't find anything that looks like that. To clarify, I'm talking about the black fry pan at the beginning, not the silver one he makes the sauce in.","meta":{"section":"Cooking","utc":1463275189}}
{"text":"Also, I really wanted to learn about carving boards. Which I have. I now know more about cooking which should be the point of r/ cooking.","meta":{"section":"Cooking","utc":"1424004347"}}
{"text":"And this is why I think all of this is so shady. Your account is only four hours old and your one and only comment is about this rice cooker. Don't get me wrong though, I still applaud Yum Asia for bringing Zojirushi appliances to Europe!","meta":{"section":"Cooking","utc":1531333019}}
{"text":"^(Hi, I'm a bot for linking direct images of albums with only 1 image) **https://i.imgur.com/a924v8O.jpg** ^^Source ^^| ^^Why? ^^| ^^Creator ^^| ^^ignoreme^^| ^^deletthis","meta":{"section":"Cooking","utc":1562077147}}
{"text":"What kinda awful shared parenting is every other day? What sane judge would allow that?","meta":{"section":"Cooking","utc":"1432884735"}}
{"text":"Alternative. Pat dry, seasoned flour, egg, breading.","meta":{"section":"Cooking","utc":"1342842040"}}
{"text":"So I had a set of white dishes and I broke every single one within a year. 3 years ago I inherited my grandmother's 'everyday' plates. Brown rim with a big orange flower off to the side. Matching canisters and mugs. Almost everyone has had something nasty to say about my plates but they are heavy and sturdy, I've dropped a plate or two and not even a chip. But something I learned from my mother is if someone's going to complain about the free meal you're providing them - they aren't grateful enough for you to continue cooking for them.","meta":{"section":"Cooking","utc":1548429525}}
{"text":"only when cooked","meta":{"section":"Cooking","utc":1543071377}}
{"text":"25 minutes? I bet you can play golf with those.","meta":{"section":"Cooking","utc":1470025226}}
{"text":"The same amount of a 2:1 simple syrup will give same sweetness with no taste","meta":{"section":"Cooking","utc":1506568337}}
{"text":"If you want to try a pasta sauce, here are some possible recipes. If you can, try cooking it at least once before cooking it for someone else. As an alternative, have you considered taking her out to dinner and perhaps making a dessert?","meta":{"section":"Cooking","utc":"1380226222"}}
{"text":"Made the sauce to test it out. It's a flavor powerhouse. Maybe too much in fact. Might try and tame it a bit.","meta":{"section":"Cooking","utc":1522252214}}
{"text":"Haha fair enough mate, you're a kinder soul than I.","meta":{"section":"Cooking","utc":1536421273}}
{"text":"Cooking? :)","meta":{"section":"Cooking","utc":1486044264}}
{"text":"That's the one I use. The julienned basil really does add to the dish and pine nuts...drool! Here's a direct link to the Food Network page.","meta":{"section":"Cooking","utc":1491179295}}
{"text":"it comes with a kinda cardy' base that is oven friendly but i have a combination microwave oven which can cook microwave or grill or convection. My worry was if this base is safe to be in a combi seen as its safe in an oven","meta":{"section":"Cooking","utc":1505226492}}
{"text":"Oh, so you're just here to shit on me to make yourself feel good. If you were interested in my reasoning, you would have asked for it and I would have given it gladly and included several reasons you don't seem to have thought of, but now you've written yourself off. Here, have a downvote.","meta":{"section":"Cooking","utc":1513037907}}
{"text":"I would feel bad :(((((. If I was a parent :))))","meta":{"section":"Cooking","utc":"1368884146"}}
{"text":"Well yeah, we could all save a lot if we just took everything from Clarence's bin, but that's stealing!","meta":{"section":"Cooking","utc":1476668153}}
{"text":"Sure, that would work you could heat it in a frying pan too with a little bit of oil","meta":{"section":"Cooking","utc":1478035285}}
{"text":"Thin crust pesto pizza.","meta":{"section":"Cooking","utc":1548905122}}
{"text":"I wash rice when someone complains that I didn't wash it. Although no one notices the difference. So normally I don't wash it.","meta":{"section":"Cooking","utc":1539219933}}
{"text":"Mayo on a BLT? That would clobber all the other flavors. You';re right - sub PB for mayo.","meta":{"section":"Cooking","utc":"1357355223"}}
{"text":"Plain old water... ...laced with a few drops of LSD...","meta":{"section":"Cooking","utc":1528247771}}
{"text":"Gotta agree with this. An instant read thermometer is crucial for cooking meat, especially if you're just starting out. Over or under cooking meat will either make you sick or not enjoy your food. If you make yourself sick or hate the food you cook, you'll stop cooking. Nothing has improved my kitchen life like an instant read thermometer did.","meta":{"section":"Cooking","utc":1502067697}}
{"text":"/r/castiron","meta":{"section":"Cooking","utc":1454464214}}
{"text":"How serious about it for you? The Kitchen Aid mixer is going to be your most flexible/most justifiable option. But there are a huge range of dedicated machines out there.","meta":{"section":"Cooking","utc":1462495640}}
{"text":"Yum! Thanks!","meta":{"section":"Cooking","utc":"1437523819"}}
{"text":"Soba noodles make a good gagh :)","meta":{"section":"Cooking","utc":1453814768}}
{"text":"I'm CO native and I'm getting angry that all these Texans keep moving here but we're not getting more proper BBQ.","meta":{"section":"Cooking","utc":1554863578}}
{"text":"I am missing something in your question, I think. How are you keeping the chicken safe to eat if you can't keep the buttermilk safe to eat? What are your cooking conditions/situations?","meta":{"section":"Cooking","utc":"1418008093"}}
{"text":"I agree...and we will make chili especially during colder months. It's one of those dishes though that you have to change up every now and then.","meta":{"section":"Cooking","utc":1462386596}}
{"text":"Salmon Loaf 1 can drained salmon 1/2 c finely diced celery 1/2 c finely diced onion (white or yellow) 1/4 c finely diced green peppers 1 lg egg, beaten 2/3 c breadcrumbs (seasoned, no-salt) Salt and pepper (to preference) Using your hands, combine all of the above. Should have a smoother grain bitnsimialr consistency to meatloaf mix. Place into an oiled loaf pan and bake at 375F until cooked through (usually about 30 min) and a nice crust forms on the top. While you wait, make a white sauce (white roux and milk), shred hard boiled eggs into the sauce, add salt and fresh chopped dill (no pepper it’ll taste too gravy-ish). Slice loaf, top with sauce, eat.","meta":{"section":"Cooking","utc":1553472403}}
{"text":"I actually prefer this stove-top method to grilling: get a ribeye or NY strip, and then do this","meta":{"section":"Cooking","utc":"1331763135"}}
{"text":"not evil - i just clicked through thinking it was more of OP's work, and it quickly became apparent that it wasn't. despite the fact that the work you linked to looks top notch, i think it's worth pointing out that they're not from the same dude. i edited my original comment to sound less accusatory, i'm not trying to start a flame war here.","meta":{"section":"Cooking","utc":"1387563057"}}
{"text":"Low and slow in an oven. Not barbecue, but still can be good","meta":{"section":"Cooking","utc":1561859553}}
{"text":"Am I the only one who found niki to be really attractive by the end of her episode? Not just by her looks, but her personality","meta":{"section":"Cooking","utc":"1430412462"}}
{"text":"Have you looked for online recipes?","meta":{"section":"Cooking","utc":1458184497}}
{"text":"The finger test is not a good way to tell when your meat is done. Use an instant-read digital thermometer instead. You do not need to (and should not) bring your meat to room temperature before you cook it. Leaving it on the counter for 30 minutes will not appreciably raise the internal temperature of the meat and will bring the outside of the meat into the danger zone for bacteria growth. How much/when to flip/move your meat is dependent on a number of factors such as patty thickness and your goal for the burger, e.g. maximize browning vs. maximizing amount of medium rare beef. There is no one size fits all answer. Heat distribution in a pan is more a function of the material of a pan as well as time. However, pans with thicker bottoms are able to maintain their temperature better when food is added compared to thin bottomed pans which is useful when cooking burgers.","meta":{"section":"Cooking","utc":1530283501}}
{"text":"Habbersett’s? Pshaw! Rappa Scrapple all the way. With pancake syrup. &amp;#x200B;","meta":{"section":"Cooking","utc":1549021319}}
{"text":"Adam Ragusea interviews a materials professor at Stanford I think and she said it’s not a good idea to microwave your plates raw so fair warning.","meta":{"section":"Cooking","utc":1560121915}}
{"text":">Can't beat fresh chorizo. True, true, true. I love chorizo, but I have to admit that we don't make our own. It's not popular enough here, we sell maybe 2x a 100gram package per week. Surprised it's even allowed to stay in our assortment. We can only afford to make the more popular products (probably 85-90% of what we sell) ourselves.","meta":{"section":"Cooking","utc":"1438811353"}}
{"text":"Expense. They're 10-20 times the price of white onions where I live.","meta":{"section":"Cooking","utc":"1397270634"}}
{"text":"im italian and learned how to cook from my grandmother i dont think i can cook with out garlic and onions","meta":{"section":"Cooking","utc":1528136064}}
{"text":"RIP Dale.","meta":{"section":"Cooking","utc":"1343004861"}}
{"text":"Cucumber stretcher The walking B.L.T : where you build a blt in ones chef pants pocket Pock Guac: portion bag of guacamole in the butt pocket flowed by a \"good game\" ass slap","meta":{"section":"Cooking","utc":"1421253781"}}
{"text":"I call mine a chicken enchilada soup. But I also put sour cream and and a little salsa in there. (and cumin)","meta":{"section":"Cooking","utc":"1432329606"}}
{"text":"If you drank the water in most countries with sub-standard water purification systems, you'd probably have the same outcome, so maybe it's because OP grew up eating it like that? If his mother did the same thing, she could've passed some kind of resistance on to him at birth/during breastfeeding, I suppose.","meta":{"section":"Cooking","utc":1534778697}}
{"text":"> what do you think is a common mistake people make that is just a huge nope? Typing \"ect\" instead of \"**etc**\". It's an abbreviation of \"et cetera\".","meta":{"section":"Cooking","utc":"1443315140"}}
{"text":"It is not blood, it's myoglobin.","meta":{"section":"Cooking","utc":1517434297}}
{"text":"I see everything.","meta":{"section":"Cooking","utc":1560527813}}
{"text":"Soak it overnight, then scrub it, using a Brillo pad if your normal scrubbie pad plus Bartenders Friend isn't making any headway. I feel your pain. Have you got a candy thermometer? Can't make candy without one IME. Everybody burns the sugar onto a pan at least once. Don't feel bad.","meta":{"section":"Cooking","utc":"1388259791"}}
{"text":"I was in western Maine this weekend. Even though they're far from coastal, lobster rolls were everywhere. Before I stopped eating meat/fish, I liked them but didn't love them. Always thought it was weird to serve lobster on a hot dog roll.","meta":{"section":"Cooking","utc":1563825791}}
{"text":"yeah that's what I was talking about. yea I guess it's easier for him because of his set up","meta":{"section":"Cooking","utc":1483189582}}
{"text":"would you rather complete control over the saltiness of your pasta, or be forced to have it salty always?","meta":{"section":"Cooking","utc":"1349977954"}}
{"text":"Buy strawberries?","meta":{"section":"Cooking","utc":1560737055}}
{"text":"You might like Anna &amp; Christina's Grocery Bag.. There's a lot of technique - or shots at technique. It's about two decent home cooks trying to follow the direction in a variety of cook-books. What could go wrong?","meta":{"section":"Cooking","utc":1456984284}}
{"text":"until i can afford serious knives that i want..i have the JA Henckels classic santoku for everyday use they have a set with a paring knife for about 70$ on amazon","meta":{"section":"Cooking","utc":"1350500782"}}
{"text":"I make a slow roasted balsamic salmon. https://smackofflavor.com/slow-roasted-balsamic-glazed-salmon/ I'd throw this over pasta with spinach, goat cheese and maybe sundried tomatoes. For sauce for the pasta I'd just do a simple olive oil base or use some reserved balsamic glaze (that didnt touch the salmon).","meta":{"section":"Cooking","utc":1557768407}}
{"text":"Some men just want to watch the world burn.","meta":{"section":"Cooking","utc":"1340864872"}}
{"text":"Salmon would be perfect for that seasoning combo.","meta":{"section":"Cooking","utc":"1424228172"}}
{"text":"I make hummus in mine","meta":{"section":"Cooking","utc":1549115253}}
{"text":"That’s quite popular. They’re delicious and a good example of using what you have to make tasty food.","meta":{"section":"Cooking","utc":1557873016}}
{"text":"buy your mom a new set of knives and bring butter. geez. why complain if there is an easy fix?🙄","meta":{"section":"Cooking","utc":1545677740}}
{"text":"Theoretically you can, but the high amount of sugar is the one limiting factor since it'll crust and burn under high temperature. You can try evaporating most of the water from the Mountain Dew using freeze-dry dehydration method, melt down the cheese mix and then mix in the resulting clump of sugar water into the fondue and lower the temperature so it'll not burn. Or, you can just find the concentrate and mix it in, since this one doesn't have any sugar in it you can boil it (not recommended still). I can't imagine it'll taste good, though.","meta":{"section":"Cooking","utc":1498546211}}
{"text":"its a carbonara, not a cacio e pepe with guanciale ;)","meta":{"section":"Cooking","utc":1538084938}}
{"text":"Going to have to look in to those. I don't use nonstick too often, but that sounds like a nice deal.","meta":{"section":"Cooking","utc":"1423316816"}}
{"text":"Thanks Sam- You're So -Wise?","meta":{"section":"Cooking","utc":1485348779}}
{"text":"He really did.","meta":{"section":"Cooking","utc":"1432853901"}}
{"text":"Whenever I make poached pears, I make them with port wine, cinnamon, nutmeg, allspice, ginger and a bit of cloves. But I always serve mine warm, too. I feel as a Christmas food, they're best served warm. You have an interesting take on yours, using white wine, cardamom and saffron, and serving them cold. But that seems like more of a summer style.","meta":{"section":"Cooking","utc":"1326394912"}}
{"text":"You need an extractor fan. And a door on your kitchen.","meta":{"section":"Cooking","utc":1537100277}}
{"text":"Look up congee. You can use a chicken/pork stock to cook the congee in, season to taste, add thinly sliced ginger and green onion. Eventually, add white fish such as cod, with a drizzle of sesame oil.","meta":{"section":"Cooking","utc":1452116016}}
{"text":"That can't be a coincidence.","meta":{"section":"Cooking","utc":1454333696}}
{"text":"A few weeks ago someone on here commented that you could blow a chicken up with TNT and the thighs would fall down perfectly cooked and tasty.","meta":{"section":"Cooking","utc":1531086207}}
{"text":"There are no downsides, steel wool, for steel, is pretty soft, as long as you don't use soap, (and it is not non-stick, of course). *hapigood now ducks* for the people throwing pans that don't understand maintaining and developing a pan's taste - wash the pan after use in fresh water and do not use soap, wool is fine.","meta":{"section":"Cooking","utc":1561889217}}
{"text":"/r/gatekeeping","meta":{"section":"Cooking","utc":1561073741}}
{"text":"Jesus, I lived in California for 3 years and never knew that. Ate kraft the whole time.","meta":{"section":"Cooking","utc":1534333050}}
{"text":"> I've been really into making homemade dill pickles with vinegar. But you dont know if they need to be refrigerated?","meta":{"section":"Cooking","utc":1539872226}}
{"text":"No I have not.. same with smoked salmon and eggs or a _foie gras_ omelet.","meta":{"section":"Cooking","utc":1564199470}}
{"text":"looks into hobby machinist's garage* I don't care how, but you must use the lathe.","meta":{"section":"Cooking","utc":1554539491}}
{"text":"Bad bot","meta":{"section":"Cooking","utc":1531501998}}
{"text":"Not if you eat it.","meta":{"section":"Cooking","utc":1511491307}}
{"text":"https://youtu.be/kTs_Q4hEqmA","meta":{"section":"Cooking","utc":1553089830}}
{"text":"Franks red hot Half unsalted butter half salted - put as much in as you need until you reach desired spicyness Probably about 1/2 tablespoon of garlic and onion powder Splash of white vinegar Splash of Worcestershire Cayenne powder if you want an extra kick. Put on low and melt the butter and you're done This makes some pretty salty wings though, so you might want to go with all unsalted butter, I'm just addicted to salt The OG buffalo sauce recipe is just a mixture of Frank's red hot and margarine, the more margarine the less spicy I really like honey Sriracha too: Sriracha Honey Butter Garlic powder Onion Powder Soy sauce --- Sauces are great to make because you can just continually taste and add more of whatever you want.","meta":{"section":"Cooking","utc":1468769426}}
{"text":"Make a dressing with mayo, plain yogurt, curry powder, mustard powder, mustard, ground coriander, salt+pepper, cayenne pepper, paprika, minced shallots, shredded basil. Make a chicken salad with your chicken, the dressing, toasted chopped walnuts or almonds, dried cranberries, diced red peppers, minced hot chilies of your choice.","meta":{"section":"Cooking","utc":1476383337}}
{"text":"#2: Onion powder, garlic powder (not salt!), fresh cracked black pepper, and sea salt.","meta":{"section":"Cooking","utc":1494111478}}
{"text":"I’m plastic tends to harbor more bacteria than wood, and bits of plastic end up in your food. Bamboo is safer in the regard that you’re not getting plastic in your food, but it’s grass, not wood. It doesn’t provide an ideal cutting s surface, and it’s harder than wood. Something like end grain is ideal, but just a plain old wood cutting board is the best. It’s easier on your knives, provides an ideal cutting surface, you won’t end up with plastic in your food, then there’s the best thing - it has antibacterial properties, so it doesn’t tend to harbor all the bacteria that a plastic or bamboo board will.","meta":{"section":"Cooking","utc":1539732749}}
{"text":"Thank you! :-)","meta":{"section":"Cooking","utc":1478403357}}
{"text":"Lol, I let the raisin bran company do that for me.","meta":{"section":"Cooking","utc":1534277109}}
{"text":"Shakshuka","meta":{"section":"Cooking","utc":"1439345751"}}
{"text":"Hello, fraternity president here! Here's my special go-to, named Wonderpunch. It fills one 10 gallon water cooler with ice. 1 jug of Hawaiian punch One thing of Sunny D One packet of country time lemonade One packet of Koolaid One handle Everclear Fill with sprite, about 2-3L","meta":{"section":"Cooking","utc":"1446142615"}}
{"text":"Previous roommate was the same with veggies. His dinner every day was a quesadilla filled pre-cooked cubed frozen chicken from Cash &amp; Carry, the cheapest shredded cheddar all microwaved till piping hot. Occasionally, he would make the same bastardization in the rice cooker instead of in between tortillas. Oh and always two dinner rolls no matter what he was eating. It was a shame that he went to culinary school, did nothing with his skills after, has some pretty pricey equipment in his home and yet, this is what he eats.","meta":{"section":"Cooking","utc":1546937085}}
{"text":"Pretty sure it's more like 0% crab, and all white fish. I too am strangely drawn to it.","meta":{"section":"Cooking","utc":"1412220660"}}
{"text":"I fry the cold leftovers along with bacon and eggs the next morning. But I don't fry it when it's freshly made. No one in my family actually fries them when they make them either.","meta":{"section":"Cooking","utc":"1406228523"}}
{"text":"a few things! stuff them with various cheeses. (Blue or Feta). Or, blend it up with black olives, olive oil, garlic, and parsley and you have a spread for a sandwich. A metric ton of dirty martinis. http://www.101cookbooks.com/archives/green-olive-gnocchi-recipe.html just came across that while googling, and zomg gnocchi and green olives sounds really good.","meta":{"section":"Cooking","utc":"1371828050"}}
{"text":"Do you feel that it's easier to digest over just regular cooked rice?","meta":{"section":"Cooking","utc":1558271927}}
{"text":"As a professional cook, I will tell you that your opinion is spot on. Though personally I've never had problems cleaning it as cleaning is only a problem if ingredients are stuck to it. I've burned meat on a pan of this same brand/material just to see how it would react, and the carbon REFUSED to stick to the pan, it just slid around as I moved it about.","meta":{"section":"Cooking","utc":"1418007165"}}
{"text":"Wasn’t that amended in the last mandate of Bush II???","meta":{"section":"Cooking","utc":"1335146770"}}
{"text":"it can be took me years to perfect the formula but i did it. No need to thank me reddit.","meta":{"section":"Cooking","utc":"1339705375"}}
{"text":"Others have commented on how to prevent sticking, but just FYI the blue SOS scrubbing pads will easily remove any discoloration/“burn” marks from the pan.","meta":{"section":"Cooking","utc":1532278782}}
{"text":"I forgot to add sugar to lemon bars. Not a good thing to forget.","meta":{"section":"Cooking","utc":1564366321}}
{"text":"The good thing of Marsala is that it doesn't spoil... because technically any wine left open for too much becomes either marsala or vinegar","meta":{"section":"Cooking","utc":"1331148350"}}
{"text":"My wife's while face gets tingly. Sometimes her whole torso. Depends on the dose. I avoid it.","meta":{"section":"Cooking","utc":1473327818}}
{"text":"Instead of recipes, learn techniques. Sauteeing, braising, searing, temp control, knife skills, etc... Then when you eat, pay attention to each component, not just the whole dish. Always pay attention to cooking times.","meta":{"section":"Cooking","utc":1524178394}}
{"text":"Do they? I know very little about cooking curries, just that they're delicious. Can you recommend good resources for learning to cook them properly?","meta":{"section":"Cooking","utc":"1440089000"}}
{"text":"This is a good point. I'm in Canada, so cooking is one of the few things where I don't use metric, but I'll go back and annotate this recipe. Aside from baking, I'm not much of a measuring guy when I cook, so I don't think about it a lot. Incidentally, if I were going to make a cookbook, would you prefer to have something with both metric and imperial measurements, or would it be better to have a metric version and an imperial version?","meta":{"section":"Cooking","utc":"1380329051"}}
{"text":"The grill side sucks. It’s a great flat top though. Use it as such.","meta":{"section":"Cooking","utc":1563224291}}
{"text":"Swap the jalapeños for banana peppers and you're spot on.","meta":{"section":"Cooking","utc":1535504732}}
{"text":"I use my food processor for things like hummus, shredding cheese or vegetables, making ham salad, chopping fruits, vegetables or nuts, slicing summer sausage, making minced raw chicken. Does stuff fast, even, and effortless. It is not necessary for me to have a food processor as I lived without one for years but is very helpful to have at times. I think the one I have is 8 cup and that size seems fine. I don't drag it out for every time I need something chopped.","meta":{"section":"Cooking","utc":1558441073}}
{"text":"Man, everyone has hit the high notes of cumin, corriander powder and turmeric. That's the trinity. But cardamon pods, cloves, and fenugreek leaves make it the real deal. Oh, and cinnamon sticks.","meta":{"section":"Cooking","utc":"1348934848"}}
{"text":"Likely. Essential oils from the spices float to the top. Say it with me -- fat is flavour. Don't remove too much.","meta":{"section":"Cooking","utc":"1367268780"}}
{"text":"I dried and braided about that many and let them hang in my kitchen while I used them. It took me about 6 months to get through them all. You really don't need to do anything except keep them in a cool dry place out of direct sunlight and with air circulation.","meta":{"section":"Cooking","utc":"1405546191"}}
{"text":"True. But a pound of mussels with some bread and whatever you cooked the mussels in is a full meal for one person. Seems like a good deal to me.","meta":{"section":"Cooking","utc":"1426956316"}}
{"text":"probably me being dumb and not realising what you were looking for","meta":{"section":"Cooking","utc":"1406579484"}}
{"text":"please, oven bacon is best bacon.","meta":{"section":"Cooking","utc":1489949819}}
{"text":"Totally agree, but maybe I can reframe it a bit - many \"new to cooking, help\" posts seem to be asking \"I don't know how to cook anything - how do I cook everything?\" The answer is start by cooking one thing, then a couple things, then more things. A journey of a thousand steps, and so on - it is platitude, but it is true. The trick is that you will get a lot more out of learning to cook your favorite food, than just any food. I am sure learning to cook to feed yourself, or to accumulate skills has value, but I don't see that keeping anyone's interest for very long. You may stop cooking before you reach proficiency at anything. If once you can successfully execute your first, second and third favorite dishes, you can then parlay that into a growing list of recipes, techniques, skills. This may sound corny, but it is important to be excited about not only about the pulling off a dish, but the dish itself.","meta":{"section":"Cooking","utc":"1358490305"}}
{"text":"http://www.businessinsider.com/never-thaw-frozen-steaks-before-cooking-2014-8","meta":{"section":"Cooking","utc":"1436908032"}}
{"text":"I think a lot of the recipes are made with Textured Vegetable Protein, not ground beef.","meta":{"section":"Cooking","utc":"1413378200"}}
{"text":"Most stores are open where I'm from, until noon or a little later.","meta":{"section":"Cooking","utc":"1385092912"}}
{"text":"> Bland tacos are disgusting. Certainly not as good as properly seasoned tacos, but if you've got some good cheese, a good homemade salsa, some fresh lettuce, and most important, good homemade tortillas, you can still have a damn good taco.","meta":{"section":"Cooking","utc":1564409242}}
{"text":"I've never looked into any service like that, but I can't see any way that it won't be extremely expensive to have meat kept cold and shipped to you. Perhaps you could invest in a freezer and find a butcher shop to take a trip to once every few months.","meta":{"section":"Cooking","utc":"1422994091"}}
{"text":"The sweet kind, right? Mont Blancs are the most famous use. In general it's good as a flavouring for dairy-based dessert mixtures - I like it mixed with whipped cream as a lighter Yule log filling, and mixed into pastry cream for filling choux buns and eclairs.","meta":{"section":"Cooking","utc":1536010941}}
{"text":"So basically, you're saying your mother is a witch? I also want to try her baklava.","meta":{"section":"Cooking","utc":"1445136112"}}
{"text":"Spitting in saute pans to see if they're hot enough","meta":{"section":"Cooking","utc":"1422304119"}}
{"text":"Jeffrey Steingarten called Ketchup the \"American Mother Sauce\". I have to agree.","meta":{"section":"Cooking","utc":"1418838028"}}
{"text":"Like any piece of equipment, you only draw the value paid out by actually using it. I have a heavy-duty Cuisinart with 3 different sizes of bowls and several blades, discs, and even an attachment for making meringue or whipped cream. Pros: * Makes quick work out of laborious tasks (grating, dicing, kneading, etc) * Can broaden your kitchen repertoire to include dishes that you don't normally prepare * Many foods you purchase prepared (hummus, mayo, dressings, soups/purees) can be MUCH less expensive and more tasty at home Cons: * Can be heavy/bulky and take a lot of valuable storage space * Can be a chore to clean (I try not to rely too much on the auto dishwasher bc the plastic parts can become brittle because of the detergents and heat) I use mine on average 2-3 times a month and have had it for 15 years. Over that time, I'm sure I've recouped the investment and know it's expanded my cuisine.","meta":{"section":"Cooking","utc":1506884443}}
{"text":"You should always ask when they were thawed or placed out, and ask to smell them before you purchase them, they should have zero fishy smell, that \"fishy\" smell is not present in freshly thawed or freshly caught fish or shellfish. It's the smell of rot. Often you're better off buying a bag of frozen ones and keeping it in the freezer and just thawing a few at a time, the grocery store often just takes a bag out of the freezer that they will also sell by bag and just thaws them and puts them out. Then if nobody buys them they stay there for a few days. If you cooked them super simply with just salt and oil/butter then there is no reason they shouldn't be sweet and delicious.","meta":{"section":"Cooking","utc":1518669131}}
{"text":"Maybe in the same way microwave dinners were the future at one point. Convenient? Sure. I guess the question is would you prefer souless mediocrity or something extraordinary. It might be the future, just not my future.","meta":{"section":"Cooking","utc":"1433356130"}}
{"text":"I read this as \"how did you get into prostitution?\"","meta":{"section":"Cooking","utc":"1447781586"}}
{"text":"caprese salad","meta":{"section":"Cooking","utc":"1338940233"}}
{"text":"I do usually just dump it into the sink then clean it all out in the end. The bowl idea saves me the hassle of scooping up the leftover soggy food bits when I'm done. So: bowl in sink --> good idea --> thanks!","meta":{"section":"Cooking","utc":1499390828}}
{"text":"I have a few: Add canned pumpkin puree and pumpkin pie spice (makes the brownies super moist as well) cheesecake swirl brownies are always a hit add peanut butter and coconut flakes make blondies since its basically easter just put cabury mini eggs on top and frosting my personal favourite, add just enough cherry cola to add flavour and top with a homemade root beer frosting and serve with banana's foster","meta":{"section":"Cooking","utc":1554856764}}
{"text":"Well well well... That sounds awesome! Melted cheese with mustard, on rye? Maybe with chili, making it like a Coney sandwich. Yes. Sign me up! Thanks for the idea!","meta":{"section":"Cooking","utc":"1442707117"}}
{"text":"Variable cheese grater. The surface area would automatically adjust to the size of the cheese block. The shred size would be manually adjustable. Also self cleaning. Also safety so it wouldn't shred skin, plastic etc.","meta":{"section":"Cooking","utc":"1434214891"}}
{"text":"Not this year, but my first year cooking the whole meal it was just myself, my husband, and our best friend. I had never cooked a turkey before. All the sides were done, and this tiny bird had been in the oven forever, but my digital meat thermometer was still saying it wasn't done. After many hours I took it out to carve into it and check, and it was dry as a bone. Digital meat thermometer was set to Celsius instead of Fahrenheit. We had sides for dinner that year.","meta":{"section":"Cooking","utc":"1448637807"}}
{"text":"That’s a great one! You can also do what my grandma did and eat it with cinnamon.","meta":{"section":"Cooking","utc":1551119764}}
{"text":"It's totally a good match. Honestly, I'm a believer that any ingredient goes together with more things than it doesn't, the trick is in proportions and balance. Try that combo on some chicken wings. Off top top of my head, I'd say take the honey and pepper, mix them with a deep liquor like whiskey or rum to make it more liquid, then toss your wings in that. Or, you could brown some onions, maybe fry some mushrooms in there too, deglaze with the liquor, add garlic, honey, black pepper, and thicken with your technique of choice to make a sauce to put on burgers, ribs, or whatever.","meta":{"section":"Cooking","utc":"1369153875"}}
{"text":"the margarine will work fine","meta":{"section":"Cooking","utc":1530478505}}
{"text":"What is whole wheat rice? Is it wholemeal risoni?","meta":{"section":"Cooking","utc":"1400888354"}}
{"text":"Do you let the leftovers cool before you out them away? It might be condensation from the veggies.","meta":{"section":"Cooking","utc":"1408721934"}}
{"text":"A seasoned encrusted prime rib. A good red wine will also go great with the pairing.","meta":{"section":"Cooking","utc":1499967826}}
{"text":"you cant make a house with soft cookies. it just wont happen. furthermore, even if you did, the gingerbread house will sit out in the open air and dry out. in the end it wont matter if you are able to make it out of soft cookies. dont eat your gingerbread houses. they are dried out and specifically rigid so they can be gingerbread houses.","meta":{"section":"Cooking","utc":1544637546}}
{"text":"Home-made ramen from scratch, including the noodles, kansui is hard to find so I had to make that myself too.","meta":{"section":"Cooking","utc":"1443161793"}}
{"text":"Curry powder is a British/Dutch invention as are many of the recipes that use it.","meta":{"section":"Cooking","utc":1483984134}}
{"text":"Seattle, WA is known for a lot of things, but smoked salmon is definitely one of them. I really love it as a chowder. \"All Roads Lead To The Kitchen\" blogger has the Pike Place Market's recipe and it is great.","meta":{"section":"Cooking","utc":1507052173}}
{"text":"I'm not trying to pick apart your technique, but artisan pizza has been an obsession of my over the last few years and I think that I can offer some suggestions which may help even further improve your pizza, if you're interested. If nothing else, this may be a brain dump for anyone interested. Rising bread in the oven is a no-no; rising shouldn't happen in environments above 80F and it will likely dry out the outside of the dough at that temp. Slow ferment=flavor. Most people these days actually prefer a slow ferment in the fridge for ~12-24h. I like to then let it sit on the counter for ~3 hours after fridge ferment that before shaping, but some people say only 45m-1h is necessary. Also, you don't need pizza dough to double in size. Most bread bakers actually say it's not about volume increase, but the feel that lets you know when your bread is ready. If you're hand kneading you can knead for 45 minutes, but its pretty easy to overknead with a mixer. I prefer the romantic nature of working with my hands with the dough, so I really can't comment much on automatic kneading. I just took a bread class from some crazy French guy that makes amazing bread, though, and he says he recommends no more than ~10 minutes on the mixer. If you're working with wet dough, this French Fold technique is great (http://www.youtube.com/watch?v=PvdtUR-XTG0) and the secret is to pull it off the counter real quick. Quick sharp movements. I've never had good luck with the broiler. I have a gas stove, though, so my broiler doesnt seem to get as hot. I can get a stone to ~660F without any oven tricks. I like to be at around 730-750 since I prefer a Neapolitan style. Sometimes I'll throw a frozen washcloth on the oven's thermometer to get into the temperature I like to bake at, though you need to remember to take that off when you're done (true story). Google 'Little Black Egg' (http://www.youtube.com/watch?v=WtXTMufUMh0) if you are interested in an affordable outdoor pizza oven (this may be a summer project for me) capable of getting into Neapolitan temps. If I could boil down my beginner mistakes, they would be: * Measure ingredients out on a scale. Measuring flour by volume is too inaccurate. * Don't fear wet dough, and don't reach for flour when it is too wet. Trust the hydration ratio when you're starting out. Kneading will transform the gluten into something workable. The more flour you add, the more uniform your dough is going to become. 60% is a good place where it is manageable, yet still rewarding. * Preheat the stone for 1+ hour. Get that sucker hoooooot. Verify temp with an IR thermometer. The hotter you get it , the more open crumb (big flavorful holes) you get because you get better oven spring. * Use sauce and toppings minimally, or deal with your pizza sticking to your peel. * Work fast while preparing the pizza with toppings. I usually have it sauced, topped, and in the oven in about 60s from transferring the naked shaped dough onto the peel. Every 15s I'm shaking the peel to make sure nothing is sticking. Making pizza (Napels style, at least) may be one of the hardest things to do properly in the kitchen. It's quite an art form, and takes quite a bit of practice. The good pizza makers seem to make pizza almost once a week at home. Varsano's site helped me tremendously when I was getting started: http://varasanos.com/PizzaRecipe.htm And I always pick up little things here and there from pizzamaking.com.","meta":{"section":"Cooking","utc":"1326769916"}}
{"text":"Yup, look for pink and no seeds.","meta":{"section":"Cooking","utc":1561578238}}
{"text":"Not always all together but... * ginger * garlic * sesame oil/seeds * red pepper * chinese 5 spice (star anise, Szechuan peppercorns, fennel, cinnamon, and clove) or some of the ingredients * soy sauce * curry powder ...and don't forget aromatic vegetables - onions, carrots, celery, bell peppers. Fresh herbs like basil &amp; cilantro are always nice.","meta":{"section":"Cooking","utc":1476910057}}
{"text":"Brining helps a lot. Equal parts salt and sugar mixed with water is all you need, but I like using soy sauce and brown sugar.","meta":{"section":"Cooking","utc":1470147862}}
{"text":"Cheesecake is more a “no one I care about loves my recipe enough for me to take the time,” kind of thing. It does make a fair mess, but then I’m eating it alone at the end. Which is nice sometimes but I think everybody cooks to share... next time I get up the nerve though I’ll translating your method for my cheesecake too! Thanks!","meta":{"section":"Cooking","utc":1550941226}}
{"text":"i would probably do that but i just like sugar","meta":{"section":"Cooking","utc":1546362065}}
{"text":"/r/pizza You can try a baking steel, but really /r/pizza is the place for questions of this nature. https://old.reddit.com/r/Pizza/comments/cdip5e/biweekly_questions_thread/","meta":{"section":"Cooking","utc":1564429229}}
{"text":"i can't maintain an angle for that long.","meta":{"section":"Cooking","utc":1521526404}}
{"text":"Do you happen to have a kitchenaid or something similar?","meta":{"section":"Cooking","utc":1449805588}}
{"text":"My husband and I are addicted to their butter and their organic ketchup. I also really like their olive oil (sorry I can't remember which we bought) and their balsamic vinegar. Also, three buck chuck.","meta":{"section":"Cooking","utc":"1438194962"}}
{"text":"-Loosen up that risotto, chef - yes, chef","meta":{"section":"Cooking","utc":"1345761897"}}
{"text":"I just made a big part of Gulash that will last me the week. 1,5kg chuck roast cut into large cubes 1,5kg onions some chopped finely some chopped more rustig (goal is to get part of the onions to disintegrate into the sauce) 5 cloves of garlic brown the beef, remove from the pot and sweat the onions until translucent add a quarter cup tomato paste to the onions and give it some coloring. Add garlic and deglaze with red wine if you have some on hand. Two tablespoons of paprika (smoked works best), a tespoon of thyme, a teaspoon of majory, 2 tsp of caraways seeds and fill up the pot with chicken or beef stock. Simmer until beef is tender and sauce nice and thick. You don't need a thickening agent because the onions will make it a nice thickness. Gulash goes great with thick cut noodles and red cabbage","meta":{"section":"Cooking","utc":1488716582}}
{"text":"If i have a plan, i know what i need ahead of time, and can better budget my spending. Spontaneous meals every night means buying in more and less planning to use ingredients accross multiple meals, and means higher overall cost accross the week","meta":{"section":"Cooking","utc":1511269767}}
{"text":"Pizza sauce I can crushed tomatoes 1 can tomato paste 1/2 teaspoon salt 1/2 teaspoon chilli powder 1/2 teaspoon garlic powder 1 and 1/2 tablespoons of oregano Mix together and it’s ready. No cooking necessary. Why would you buy it? Easiest sauce you can make.","meta":{"section":"Cooking","utc":1534852481}}
{"text":"A bit like spinach, but milder, more subtle, slightly peppery. Perhaps half-way between spinach and celery? But IMO it's not even as strong-flavoured as either of those; it's really quite a subtle flavour. Personally I don't think it needs any herbs at all, though seemingly chives combine well. Just a little salt and pepper is enough to bring out the flavour.","meta":{"section":"Cooking","utc":1493559248}}
{"text":"I don't think I hate mayo. I am definitely not in love with it. This could be it though. Thanks!","meta":{"section":"Cooking","utc":1481506204}}
{"text":"Green peppers in the oven... smells so damn good","meta":{"section":"Cooking","utc":1554848386}}
{"text":"Minute Rice and other precooked rices are easy to find. If you have access to an Asian grocery, there's many noodle varieties that cook quickly. I cooked bean noodles with a pour-over of boiling water on my last camping trip, and I just found some rice noodles to try for my next trip.","meta":{"section":"Cooking","utc":1500318193}}
{"text":"It's oxidized. Go for it.","meta":{"section":"Cooking","utc":1549850665}}
{"text":"I have all three. I use the rice cooker the most (just for making rice; I like rice), and the Instant Pot next. These days the only thing I use the slow cooker for is when I take a dish to a potluck dinner; I use it as a warmer.","meta":{"section":"Cooking","utc":1533871894}}
{"text":"I never bothered with store-bought marinade because it's, well, inferior. You can do better at home, here are three examples: 1. Garlic, onion, chili pepper, black pepper, thyme and/or sage, salt, brown sugar, yellow mustard, veg oil, red wine vinegar. Don't go fancy on the oil, but do go fancy on the vinegar. 2. Soy sauce, mirin, brown sugar, ginger, sesame oil, veg oil. It'll probably taste similar to your store-bought marinade, but better. Take it easy on the sesame oil, just some drops are enough. 3. Garlic, cumin, cinnamon, cardamom, black pepper, red pepper flakes, smoked and spicy paprika, salt, lemon juice, veg oil.","meta":{"section":"Cooking","utc":1550363791}}
{"text":"Then say 1 year old.","meta":{"section":"Cooking","utc":1542762174}}
{"text":"He has a super high quality camera, a good voice, and very nice hands. He does have a “basics” series that is actually instructional in nature and it’s fine, better than most instruction/cooking videos on YouTube. It’s good for exposure to stuff.","meta":{"section":"Cooking","utc":1535523684}}
{"text":"Stock of your choice. Water. Add a splash of lime/lemon juice or some vinegar to make up for the missing acidity if you want it to behave more like wine. Do be conscious of the salt you're adding if you use a salted stock though.","meta":{"section":"Cooking","utc":1520041574}}
{"text":"No milk for mac n cheese? Use mayonnaise. Don't like mayo? Use ketchup. No mayo for tuna? Use mustard. MUSICAL Condiments!","meta":{"section":"Cooking","utc":"1327649309"}}
{"text":"Seconded, it's a classic. One of my favorite shows of all time.","meta":{"section":"Cooking","utc":1520608032}}
{"text":"New Orleans style barbeque shrimp is fantastic. Probably won't be very Australian, but it will be awesome.","meta":{"section":"Cooking","utc":"1419105202"}}
{"text":"Totally fine. It was only 8 hrs I wouldn’t leave them too long though. Cook very soon","meta":{"section":"Cooking","utc":1555371700}}
{"text":"I agree with you, roasting is one of the best ways to prepare them. But if you’ve got a grilling basket, toss em in olive oil and salt and grill em. That’s my fave. Same with asparagus.","meta":{"section":"Cooking","utc":1546438737}}
{"text":"When people request a specific thing that I make, I always take that as a huge compliment.","meta":{"section":"Cooking","utc":1466876379}}
{"text":"Except some people don't eat buns. We typically just put the finished burger in a tortilla and sear it on both sides. Also just because you have a bun does not mean you should be adding yet more bread to your diet. You do you but thought I would try to clarify what they are likely saying.","meta":{"section":"Cooking","utc":1535934667}}
{"text":"I think pizza is a magical item that can be left forever and still be edible.","meta":{"section":"Cooking","utc":"1430387324"}}
{"text":"I do, I live in Austin Texas so a lot of things are very accessible. I just don't know much about a good wok and want to get in to it","meta":{"section":"Cooking","utc":"1436999242"}}
{"text":"Isn't this joke pretty tired by now?","meta":{"section":"Cooking","utc":1541439374}}
{"text":"In regards to the seafood, I had a question. So the Pacific market near me has all manner of land and sea animals (some of the latter even live), but the department always smells awful-- despite being near the back of the fairly large store, you can smell it right as you walk in the doors. My understanding of seafood was that if it was fresh/good, it should never smell \"fishy,\" so I have never bought meats from there. Is my understanding incorrect, or is this market indeed not selling good meats?","meta":{"section":"Cooking","utc":"1415937935"}}
{"text":"This straight up made me cry. That pot is identical to one my mom had, and this is exactly how she made me chicken noodle soup (except she used egg noodles) when I was little (she called it Bunny Get Well Soup [because I was \"bunny\"]). This is awesome.","meta":{"section":"Cooking","utc":"1401721253"}}
{"text":"Yep, I did this too. Won't make that mistake again. I panicked at the time because I thought for sure I was going to burn down the apartment building. Sprayed the ENTIRE fire extinguisher and then spent the next week cleaning it off the stove, counter, walls, ceiling...","meta":{"section":"Cooking","utc":1515978830}}
{"text":"Buy a mini-fridge","meta":{"section":"Cooking","utc":1507058412}}
{"text":"Fried Rice. Withan egg and mixed vegetables. Quick easy in expensive.","meta":{"section":"Cooking","utc":"1411003117"}}
{"text":"This is fine and kind of preferred. Don't completely thaw it. Let it thaw in the refrigerator for about an hour or two. You want it semi-frozen. This makes it easier for the grinder and helps keep your fat together. How I will usually do it is partially freeze the meat and then cube it in to about one inch pieces. Then I throw that back in the freezer for about half an hour. To help keep it cold I will keep the pieces in a bowl that is sitting in a another bowl of ice. If you are doing a double grind do the same bowl set up for the meat coming out of the grinder. And you might want to let rest in the freezer again before the second grind.","meta":{"section":"Cooking","utc":1476753953}}
{"text":"Is it really that disingenuous? OP put \"nikujaga\" in parentheses right after, so there really isn't much to be confused about here. Also, I've had Japanese beef stew (as opposed to Japanese \"beef stew\" -- just moved back to the US from Japan, actually, after a five-year stint) and it really isn't any different than beef stew anywhere else in the world; beef stew made with demiglace is not exactly uncommon outside of Japan. There are plenty of better examples of 洋食 (youshoku, what Japan calls \"Western food\") in Japan that have been more uniquely edited to fit Japanese palates. At any rate, I'll be hopping off the pedant train at this stop.","meta":{"section":"Cooking","utc":"1382137983"}}
{"text":"They weren’t frozen to begin with, just extremely cold. I smelled them before freezing and they smelled fine to me, but I’m not an expert.","meta":{"section":"Cooking","utc":1553725766}}
{"text":"Whelp, I got started about an hour ago, so a bit too late because they definitely got all wonky and weird when I was browning them. Lesson learned the hard way but now I know what to do next time! Thanks!","meta":{"section":"Cooking","utc":"1404202144"}}
{"text":"The ones I really try and keep around for cooking are vermouth, cooking sherry, beer, and cognac. I recently started cooking with cognac, and it adds some really good flavor.","meta":{"section":"Cooking","utc":1457102919}}
{"text":"Cheers! I had thought that was just the U.K. version of the Home Cooking book we got in America. I didn't know it had different recipes.","meta":{"section":"Cooking","utc":"1446496456"}}
{"text":"How often do you use it? I use mine almost daily, so I doubt I've ever cooked on rancid oil","meta":{"section":"Cooking","utc":1477829930}}
{"text":"I put a pat of salted butter in with the water and rice. Makes the rice nice and silky with the perfect level of saltiness.","meta":{"section":"Cooking","utc":1550758985}}
{"text":"T-fal is great. I've had cookware that were way more expensive (eg. Caphalon, or some hippy dippy PFOA-free non-stick ones) but had really bad chipped coatings after a year. I've had some for over four years now and they still look perfectly smooth.","meta":{"section":"Cooking","utc":1472018406}}
{"text":"Maybe I could roast the squash and thin it out to make that the sauce?","meta":{"section":"Cooking","utc":1516281010}}
{"text":"That was always the rule in my house. I cook and set it all up. Serve yourself","meta":{"section":"Cooking","utc":1560463971}}
{"text":"When our preferences start pissing people off and becomes an annoyance, that entitlement needs serious reconsideration.","meta":{"section":"Cooking","utc":1550825094}}
{"text":"You'll crack it.","meta":{"section":"Cooking","utc":1482041862}}
{"text":"Turn any prime rib left over into a grilled steak sandwich.","meta":{"section":"Cooking","utc":1560130090}}
{"text":"Steak and eggs, steak and kidney pie, chop it up and add it to some hashbrowns and sauteed vegetables and a bit of cheddar, paninis with fried onions and red peppers, beef stew...","meta":{"section":"Cooking","utc":"1439801381"}}
{"text":"The entire 4 and 5 and 6 burner thing is a marketing gimmick for home cooks. While professional chefs and cooks are almost always multi-tasking and cooking multiple dishes at the same time, home cooks almost always using 1 or 2 burners at most. And there's nothing wrong with that either.","meta":{"section":"Cooking","utc":1560313366}}
{"text":"I prefer creamy, but my wife is firmly in your boat. She wants them what I would consider overcooked. But that's okay! We like what we like. :D","meta":{"section":"Cooking","utc":1501000196}}
{"text":"Yeah, I hate the amount of times Mac and Cheese is posted on the sub. It always looks like low grade goop.","meta":{"section":"Cooking","utc":"1406432370"}}
{"text":"Agree with braising, as well as making stews and soups. I also survived on making a ton of multi-use dinners. If I made roast chickens and had leftovers, my roommate and I would make pot pies, chicken soup, alfredo, etc. Another pro-tip is to keep a stocked pantry of dry/canned/frozen ingredients that you use a lot of (Beans, pasta, canned tomatoes, chicken stock) and only go to the market for what you need to make say, the next two nights meals. That helps you save money by knowing you're going to use everything, and it stops you from aimlessly wandering around the mart putting things in your cart. Id say rice cooker is overrated once you learn how to make it in a normal pot. Just throw your rice into a pot, wash it thoroughly to remove some excess starch, put your fingers to the top of the rice level and fill with water until it reaches the first knuckle of your middle finger. Boil, remove to low and cook until tender.","meta":{"section":"Cooking","utc":"1345053845"}}
{"text":"That doesn't negate that it's easy to make. Yes, it's easier to buy something premade. It's easier to pop open a can of soup. But pie crust is much easier and way cheaper than a lot of people think it is.","meta":{"section":"Cooking","utc":1480530958}}
{"text":"I asked reddit a year ago and have made it 4 or 5 times since (minus the shallots). It's my favorite.","meta":{"section":"Cooking","utc":"1354410306"}}
{"text":"NYT: Cilantro Haters, It’s Not Your Fault By HAROLD McGEE Modern cilantrophobes tend to describe the offending flavor as soapy rather than buggy. I don’t hate cilantro, but it does sometimes remind me of hand lotion. Each of these associations turns out to make good chemical sense. Flavor chemists have found that cilantro aroma is created by a half-dozen or so substances, and most of these are modified fragments of fat molecules called aldehydes. The same or similar aldehydes are also found in soaps and lotions and the bug family of insects. Soaps are made by fragmenting fat molecules with strongly alkaline lye or its equivalent, and aldehydes are a byproduct of this process, as they are when oxygen in the air attacks the fats and oils in cosmetics. And many bugs make strong-smelling, aldehyde-rich body fluids to attract or repel other creatures. The published studies of cilantro aroma describe individual aldehydes as having both cilantrolike and soapy qualities. Several flavor chemists told me in e-mail messages that they smell a soapy note in the whole herb as well, but still find its aroma fresh and pleasant. So the cilantro aldehydes are olfactory Jekyll-and-Hydes. Why is it only the evil, soapy side that shows up for cilantrophobes, and not the charming one?","meta":{"section":"Cooking","utc":"1394663984"}}
{"text":"Fancy ramen- buy packets and make chicken to add to it. I add a ton of veggies (can buy those cheap steamer bags). If you want to get real fancy you can make your own sauce instead of the sauce in the packet with soy,chili sauce, peanut butter and sesame oil.","meta":{"section":"Cooking","utc":"1432759925"}}
{"text":"Very interesting","meta":{"section":"Cooking","utc":1557271015}}
{"text":"It's the best, and usually how I make them myself.","meta":{"section":"Cooking","utc":1449079634}}
{"text":"Or microplane.","meta":{"section":"Cooking","utc":1560212888}}
{"text":"I think these are the type of awesome junk foods that are best from a commercially made product. There are several frozen ones that come out very good fried or in the oven. Doesn't seem worth the trouble to replicate the industrial processes used to make this kind of stuff. Like fish fingers are so much better frozen than making fresh fish. It's not that fresh fried fish doesn't taste good, it does, but it's like a totally different food. Fish fingers taste so different.","meta":{"section":"Cooking","utc":1540436615}}
{"text":"Just means someone else is stuck with the dishes","meta":{"section":"Cooking","utc":1473605894}}
{"text":"Sear it up, drop it and the pan in the broiler, like handful of mins on each side... Done","meta":{"section":"Cooking","utc":1518934721}}
{"text":"Yeah, but Owensboro tends to barbecue mutton, right? They're the only place in the state that does that--everyone else barbecues pork.","meta":{"section":"Cooking","utc":1563813886}}
{"text":"I've had great luck preheating oven to 425 with the cast iron in it. Cut red skin potatoes into quarters or smaller, and tossed in oil and seasonings of choice. Take cast iron out of oven and they sizzle like mad. Flip them at about 13-15 minutes and then keep them in there another 13-15 minutes.","meta":{"section":"Cooking","utc":"1446003589"}}
{"text":"lol i was just kiddin","meta":{"section":"Cooking","utc":1477346942}}
{"text":"I live in Texas, so 8-15 degrees C (45-60 degrees F) isn't really room temperature anywhere in the house. Having said that, can this be done in a refrigerator? That will typically be somewhere between 35-38 degrees F (2-3 degrees C). edit: nevermind. Asked and answered below. Turns out the answer is \"yes\".","meta":{"section":"Cooking","utc":"1366748002"}}
{"text":"Dropping Acid: The Reflux Diet Cookbook &amp; Cure Jamie Koufman This book was recommended by my ENT It has been a life saver. Lots of good info on management. Written by an MD.","meta":{"section":"Cooking","utc":1539522005}}
{"text":"#####&amp;#009; ######&amp;#009; ######&amp;#009; ####&amp;#009; **Instant Pot IP-LUX60 6-in-1 Programmable Pressure Cooker, 6-Quart 1000...** Current $126.14 High $144.70 Low $117.28 Price History Chart | FAQ","meta":{"section":"Cooking","utc":"1415535063"}}
{"text":"Look up #ostrichegg on instagram to see how other people have done giant breakfasts. Some inspiration there!","meta":{"section":"Cooking","utc":1499356473}}
{"text":"no peeling here, eat that skin or don't eat my potatoes.","meta":{"section":"Cooking","utc":"1426565570"}}
{"text":"If a recipe calls for parsley I will replace it with 2.5x as much cilantro plus more for garnish. I spend $75 on cilantro every week. I also just typed “cilantro superfood” on google and apparently its cleansing all the bad toxins and voodoo from my body. If I find a genie my first wish will be to turn all plants into cilantro.","meta":{"section":"Cooking","utc":1550246818}}
{"text":"Almost everything I've put MSG on was better for it except foods that are sweet and fruity. I'd made a jerk paste that was very bright and citrusy with lime juice and zest, and the MSG sorta dulled that brightness. Generally, I use it as a replacement for 1/4 of the salt I'd usually put in a dish. So if I'd normally add 2 tablespoons of salt to a soup, i'd add 1.5 tbls salt and .5 tbls MSG instead.","meta":{"section":"Cooking","utc":1557530875}}
{"text":"That’s kinda fucked up asking you to cook something and then telling you how","meta":{"section":"Cooking","utc":1535828449}}
{"text":"The rosemary and olive oil flavor are probably a separate packet. Just toss that and cook the couscous in some chicken stock and you'll be good to go.","meta":{"section":"Cooking","utc":1455314828}}
{"text":"Yes, but I think Canola oil tastes better. You can use Corn oil too, but it will definitely bring in its own flavor. Edit: The smoke point thing is something to consider. Canola oil has a pretty high smoke point as I remember.","meta":{"section":"Cooking","utc":"1360979525"}}
{"text":"Yeah, I read that. It was awful. Really bizarre. She had this strange quasi-sexual view of butchery, and bragged about how exciting it was when she was out with her lover and got recognised by a fan who assumed he was the husband. At the end of the book she decided to ditch her lover and stay with her husband, but by then he was having an affair too. So I don't know what happened to them after that.","meta":{"section":"Cooking","utc":1555110130}}
{"text":"All four of my grandparents were in the Holocaust. They knew how to get by on next to nothing. So when they had access to decent foodstuffs it came out pretty good. Also the experience. Having 30+ years to tweak your recipe.","meta":{"section":"Cooking","utc":1554478216}}
{"text":"Fuck this. You heard splendid table talk about this and now you're karma whoring.","meta":{"section":"Cooking","utc":1546508712}}
{"text":"Chinese! It's literally the only time I eat leftovers, because I have issues.","meta":{"section":"Cooking","utc":1555803181}}
{"text":"Nope. Things with broccoli still taste like broccoli.","meta":{"section":"Cooking","utc":1556501701}}
{"text":"Secret 70's weed stash discovered. +100 experience points.","meta":{"section":"Cooking","utc":"1432142847"}}
{"text":"I've never made it myself but I can seriously put away some spanikopita.","meta":{"section":"Cooking","utc":1539995539}}
{"text":"I think that article brings up some really good points. If you own some things from when you had money, and you can't really make ends meet if you sell them, why shouldn't you be able to keep them? They were poor, but they were floating; if they were in danger of bankruptcy, it'd be a bit different, but they were still able to maintain some things. Why should they feel ashamed for that?","meta":{"section":"Cooking","utc":"1420350756"}}
{"text":"Put them all in a blender. Smoothie. Win-win.","meta":{"section":"Cooking","utc":1513311993}}
{"text":"It's okay in the cupboard. The life extension in the fridge is neglegable.","meta":{"section":"Cooking","utc":1550845862}}
{"text":"No, The only advantage I see to controlling with the phone is not having to look up temps for food. To me this isn't that big of a feature I need since it varies from recipe to recipe. It doesn't have a holding temp for once it's timer is done, but you could always set it manually.","meta":{"section":"Cooking","utc":"1413137947"}}
{"text":"it depends on what type of tofu you have. soft tofu is very delicate so i would advice against deep frying it. but if you have firm tofu you can deep fry them or just pan fry them with a little bit of oil. serve deep fry tofu with some hoisin and sriracha sauce on the side to dip would be a easy way to enjoy them.","meta":{"section":"Cooking","utc":"1370940983"}}
{"text":"Indian food is a good option because you don't have to rely on meat substitutes and such that are often going to be off-putting to non-vegans. I like this recipe for rajmah (kidney bean curry) that you can make in a slow cooker, so it's also good to bring to a potluck because you can just heat it back up and keep it warm in the crockpot. I've made this recipe with butter as directed, and with canola oil instead to make it vegan -- cut down on the hot peppers in the vegan version or else I think it's a bit too spicy for a lot of people, the dairy in the original version helps calm down the spice a bit.","meta":{"section":"Cooking","utc":1474814698}}
{"text":"According to the wikipedia page, it's mostly a Chinese Diaspora dish, which varies depending on region and country. They don't have any information about chow mein actually in China. Of note, it says: >Food historians and cultural anthropologists have noted that chow mein and other dishes served in Chinese American restaurants located away from areas without any significant Asian American population tend to be very different from what is served in China and are heavily modified to fit the taste preference of the local dominant population. However, take that with a grain of salt: this wikipedia article is giving me a few red flags, and may not be a very well sourced article, at least as far as history of the dish (as we know, the quality of wikipedia pages sometimes varies).","meta":{"section":"Cooking","utc":1494952779}}
{"text":"I’m raising bourbon reds... 1at year....how are the leg tendons like tooth picks","meta":{"section":"Cooking","utc":1541816950}}
{"text":"This sounds awesome and I think it'll be prepared in our kitchen one day soon. Thank you!","meta":{"section":"Cooking","utc":1463148835}}
{"text":"I keep the turkey leftover for the sandwiches and the bones (with a little meat on it) which I used for making delicious porriage/Asian soup. I put all the gelly things/ juice form the turkey to the soup too. It is so yummy. If you are interested to know how to make it, here is the link: https://www.epicurious.com/recipes/food/views/chinese-chicken-and-rice-porridge-congee-103051 I just wonder how people in here treat with the leftover?","meta":{"section":"Cooking","utc":1545931731}}
{"text":"I love za'atar, but the form of it I acquired a taste for doesn't actually have sumac in it. (Not that I object to sumac. I recently made a point of trying it..)","meta":{"section":"Cooking","utc":1495084507}}
{"text":"Yeah. I elevate them from the plate to my mouth hole.","meta":{"section":"Cooking","utc":1513375140}}
{"text":"Wow. TIL. Never would have expected that.","meta":{"section":"Cooking","utc":1555600961}}
{"text":"kikoman is a great brand actually","meta":{"section":"Cooking","utc":1530221854}}
{"text":"The big difference, as you probably know, is that when you simmer bones, you extract all the gelatin, plus you get the collagen from any connective tissue that is on the bones. Both providing flavor and more importantly, body to your stock. With vegetable broth you can emulate this with the addition of agar agar.","meta":{"section":"Cooking","utc":"1415610375"}}
{"text":"I'm just curious, why did you post this comment?","meta":{"section":"Cooking","utc":"1363976631"}}
{"text":"healer of sauce what?","meta":{"section":"Cooking","utc":1514876105}}
{"text":"Yep! Sometimes I add sugar, but not to my last batch.","meta":{"section":"Cooking","utc":1541862587}}
{"text":"Going to try this. Sounds great!","meta":{"section":"Cooking","utc":1465851903}}
{"text":"I will post you black beans if you want.","meta":{"section":"Cooking","utc":"1420868980"}}
{"text":"There was a time I used MSG quite a bit myself. However, I discovered that the food made without was far better. Of course, it may simply be a case of misuse or overuse for some, but generally if you are asking for assistance from r/cooking I expect better answers than MSG.","meta":{"section":"Cooking","utc":"1412311999"}}
{"text":"ugh i always burn it or undercook it. is there a secret?","meta":{"section":"Cooking","utc":1463079850}}
{"text":"In rouladen sauce","meta":{"section":"Cooking","utc":1540920408}}
{"text":"Chicken liver is tasty! Bird livers (duck, goose, chicken etc.) are totally awesome, compared to pig/veal.","meta":{"section":"Cooking","utc":"1376579045"}}
{"text":"Beef cheek makes the best pulled beef around. Sounds strange but trust me, that’s true barbacoa. Put it on a corn tortilla with some queso fresco and fresh pico and you’re in heaven.","meta":{"section":"Cooking","utc":1547676911}}
{"text":"This is what I'm thinking. The oysters I spent years opening were significantly smaller.","meta":{"section":"Cooking","utc":"1439082768"}}
{"text":"Honey roasted almonds AND peanut butter? That is a whole meal worth of calories in the appetizers, and you are right, it is a very sweet menu. I put in a huge post here for you what I do regularly in our GF house. If you do want to do brownies, it would be nice. I can't tell you how much we miss cakes, cookies and such and to show up to a friends house and have them safe to eat would be a wonderful surprise. I would eat them all, just saying. Oh, slow cooker meat, good, but never wows like a nice piece of seared meat and some sides. I love my slow cooker and it helps keep being GF easy, but I wouldn't serve it if entertaining just because of my own preference. You may be better at the slow cooker than me though. ;-) I do have one very easy and pretty recipe for slow cookers. You could go Mexican and do this: 1 chicken breast for every 2 people (this will be way more than needed but just enough to be safe in case everyone want seconds. 1 large jar salsa per every 4 chicken breasts 1 can rotel of your chosing 1 packet of taco seasoning per every 4 chicken breasts let that slow cook over night have the following: corn tortillas- green cabbage- shred your own cheese- another jar of salsa- beans if needed- tomatoes, onions, or any other taco veg do brown rice in a rice cooker on the side (brown rice and salsa is AWESOME!) When the slow cooker is done after 4-6 hours on high, shred the chicken into the remaining salsa compote and you have fantastic chicken tacos with rice and beans on the side. I do this once a week to make my husband's work lunches. 4 chicken breasts covers about 3 work meals, and 3 family meals for 4.","meta":{"section":"Cooking","utc":"1363884030"}}
{"text":"I would say get the saucepan because it gives you more options. The uses of a Dutch oven and a pressure cooker overlap quite a bit (although obviously the pressure cooker would be much quicker). The saucepan is less specialized and I think youd end up using it more. That being said, I would definitely advocate for making space for both if possible, just because pressure cookers are really fun. But that specific one you linked is needlessly expensive.","meta":{"section":"Cooking","utc":1494941543}}
{"text":"My partner at the time once mistranslated the amount of salt he needed from an American recipe and but 10 grams in chocolate brownies. It was like eating chocolatey seawater...","meta":{"section":"Cooking","utc":"1410564084"}}
{"text":"be careful not to get super pasteurized milk. I tried it with this and got almost zero curd","meta":{"section":"Cooking","utc":"1328101554"}}
{"text":"Oh god. My rural midwestern born ass loves meatloaf, but my boyfriend is pretty “meh” on it, so I never make it. Next time he’s out of town for work, I’m absolutely making it. With garlicky mashed potatoes and roasted broccoli.","meta":{"section":"Cooking","utc":1553016659}}
{"text":"I love putting marinated artichoke hearts in my salads. Add a little feta cheese and some black olives. Then I use a light dressing, maybe just a little bit of olive oil and pepper.","meta":{"section":"Cooking","utc":1522359447}}
{"text":"I didn't used to like runny yolks until I started dipping my thick cut bacon in it, give it a shot!","meta":{"section":"Cooking","utc":1483591564}}
{"text":"brulee sugar on your grapefruit with it.","meta":{"section":"Cooking","utc":"1375564543"}}
{"text":"I agree with going by recipe first. It's easy to throw a lot of money away buying up random spices. And having to keep adding to it because you can't possibly buy them all from 1 place. I get my spices from various stores.","meta":{"section":"Cooking","utc":1469395937}}
{"text":"I don't own any knives worth more than about £45, but I've just got one 1000 grit whetstone similar to this one and it seems to do the job fine for me without any overly artisanal skills required to use it. I mainly got it for a small japanese petty knife (photo from google, not my one) that I got whilst in Tokyo, as steels would absolutely destroy it. For proper use you soak it for hours and then set it down and sharpen it using both hands. I'm lazy however, and I've found I can get it razor sharp (for my requirements) by just holding it under a very lightly running tap and sharpening the knife with one hand. That's sacrilege for knife snobs, but works perfectly for my knives and doesn't require a massive work area like traditional sharpening does.","meta":{"section":"Cooking","utc":"1399743346"}}
{"text":"Does iodine salt not draw out meat blood?","meta":{"section":"Cooking","utc":1561895045}}
{"text":"Holy Eggplant parmigiana!","meta":{"section":"Cooking","utc":1540485158}}
{"text":"I make a batter. I think it's super simple like a cup of flour, cup of milk and some seasoning. If you want beer-battered put 1/2 c beer 1/2 c milk. You want the batter to be thick but not lumpy. I need to double check the measurements to be sure, it's from The Better Homes and Gardens Red cookbook binder. I use vidalia onions since we live about 2 hours away from Vidalia, GA and they are always stocked in my Publix. They also have a great flavor since they are sweet. Perfect for onion rings. I like frying in peanut oil, which is something I only started doing recently. But vegetable oil works too for those who may not want peanut oil.","meta":{"section":"Cooking","utc":"1413404030"}}
{"text":"My parents built a 9'x3.5' island in their house and it has 2 inch maple butcher block top. It's so beautiful and amazing to use.","meta":{"section":"Cooking","utc":1501436258}}
{"text":"Thank you everyone for the suggestions, I've got so much to make!","meta":{"section":"Cooking","utc":1551017347}}
{"text":"A very helpful infographic for people who think they can buy kitchen skills.. lol.","meta":{"section":"Cooking","utc":"1390574124"}}
{"text":"Testing my psychic powers... (Whoops!)","meta":{"section":"Cooking","utc":1556822344}}
{"text":"Good tip. I usually use coconut oil for this (muffins, egg muffins, cakes). Do you think it will work for crab cakes?","meta":{"section":"Cooking","utc":1561783721}}
{"text":"This is most Chinese recipes in chinese. They read like: Chicken 400g Soy sauce appropriate amount White pepper appropriate amount Scallions 2 stems Sesame oil not much ....and you're like okay, either this is some secret cultural knowledge that I missed out on or everyone just plays it by ear.","meta":{"section":"Cooking","utc":1555911311}}
{"text":"Quesadillas- versatile, there isn't much you can do to make them inedible, and they create a solid base for some of your lower-level skills. Incredibly cheap, too.","meta":{"section":"Cooking","utc":"1414025781"}}
{"text":"I think the problem lies in not knowing when to stop, not in having a beer for breakfast... Source: Spent two weeks with a group of British tourists on Ibiza.","meta":{"section":"Cooking","utc":"1439659342"}}
{"text":"Really? \"By definition,\" all companies are immoral? Are you thirteen years old or just an idiot?","meta":{"section":"Cooking","utc":"1359770219"}}
{"text":"Why would you say that? Sous Vide allows the sausage fat to soak the sausage all through out the cooking. You loose less flavor to the pan that way. Traditionally, you try to recapture that through turning the drippings into gravy. But as I stated earlier, I got bacon!","meta":{"section":"Cooking","utc":"1425622777"}}
{"text":"Bacon wrapped dates are so good it's stupid.","meta":{"section":"Cooking","utc":"1407949467"}}
{"text":"Hate to break it to you, but that is Teflon coated anodized aluminum. Your cooking surface isn't raw aluminum.","meta":{"section":"Cooking","utc":1489675709}}
{"text":"[posted from toilet]","meta":{"section":"Cooking","utc":"1411139158"}}
{"text":"Whats not to like? Got the cream... Good! Got the jello... Good! Got the beef... Good!","meta":{"section":"Cooking","utc":"1427874248"}}
{"text":"Is there a master list of sauces that people liked/disliked? I really like the ranking that Alton did","meta":{"section":"Cooking","utc":1524788490}}
{"text":"Haha yes, I will definitely be adding apple cider vinegar to the list!","meta":{"section":"Cooking","utc":"1434935286"}}
{"text":"My SO and mom found a kitchenaid mixer for sub $200. I love it! Look around, they're out there.","meta":{"section":"Cooking","utc":"1411884895"}}
{"text":"I'm totally going to make one with pepperoni.","meta":{"section":"Cooking","utc":"1435628042"}}
{"text":"I have a 6 3/4 qt le creuset dutch oven, but I would love a 9 so I could cook larger batches, my regular soup recipes tend to fill close to the top. My mom has this massive one (11qt maybe?) but she does a lot of family gathering and event cooking... I love that thing. Boeuf Bourguignon for 25 = Merry Christmas :)","meta":{"section":"Cooking","utc":"1442350901"}}
{"text":"Worrying about the small details. Don't get me wrong, getting good at cooking is about understanding those details eventually. But I've met some \"armchair chefs\" who obsess over Good Eats and watch Gordon Ramsay videos and read Serious Eats...but they can't even cook properly because they haven't put in the time needed to understand how their oven works or develop the skills needed to properly dice veggies. When you first start cooking, just cook. Things might suck at first, but getting good is a matter of practice and you can't become a good cook overnight.","meta":{"section":"Cooking","utc":1466647386}}
{"text":"I LOVE biryani and we both don't want it to be impossible for someone who isn't a chef so I will keep this one in mind!","meta":{"section":"Cooking","utc":"1445097105"}}
{"text":"Welcome :)","meta":{"section":"Cooking","utc":1550494964}}
{"text":"I was just pointing out that it is ridiculous to say that \"collard greens are better than kale\" when the way you eat collards is with lard. That's like saying X with a ton of butter is better than Y plain. It's not a fair comparison.","meta":{"section":"Cooking","utc":1544971838}}
{"text":"Also, what kind of salt did you use? He's using kosher salt in the video but the directions just say salt. Also, different kosher salts have different densities. Just an fyi if you don't know.","meta":{"section":"Cooking","utc":1561360550}}
{"text":"I'd be OK with cheesecake soaking into the crust, as it would still be a crust and would let things stick together. I assumed melted chocolate would also soak into the crackers though, the way butter does","meta":{"section":"Cooking","utc":1476222062}}
{"text":"No trouble here. Just perfection.","meta":{"section":"Cooking","utc":1525617354}}
{"text":"Ooo, that sounds good!","meta":{"section":"Cooking","utc":"1422212936"}}
{"text":"Got mine at the link below. I love it. I place the tofu in and press snug with my hand while tighten the screws. I then do three half terns on the secrews once there is resistance. More and the tofu might break. If you want the firmest texture you can give another three half terns after ten minutes. Total pressing time for me is fifteen minutes. http://www.amazon.com/gp/aw/d/B00507GC96/ref=mp_s_a_1_1?qid=1436751144&amp;sr=8-1&amp;pi=AC_SY200_QL40&amp;keywords=Tofu+Presser&amp;dpPl=1&amp;dpID=413Y5s6d2FL","meta":{"section":"Cooking","utc":"1436751370"}}
{"text":"That would be bad. :( You wouldn't be eating live bacteria, but you would be eating their byproducts. On the plus side, the resultant food poisoning wouldn't be as severe or last as long.","meta":{"section":"Cooking","utc":1511119246}}
{"text":"All I do is give raw meat a rinse under some cold water in the sink because I don't like the slimy feel a lot of the time that meat has when coming out of the Styrofoam tray from the store, I know there are some bacteria that don't die even at high heats but I am sure this practice does little to nothing and is more of an OCD or personal preference.","meta":{"section":"Cooking","utc":1550753350}}
{"text":"Open. Frickin'. Cabinet doors. My wife has a genetic inability to close cabinet doors. I say genetic, because her sister does the same damn thing! Her sister and husband were at our house visiting (they live a few states away). My brother-in-law and I are the chefs of our respective families, so we decided to do a Marvel Team-Up. In the middle of the kitchen prep, we were flowing around each other perfectly and sister-in-law comes in awkwardly, getting in both our ways at once, grabs a glass from the cabinet, leaves the door open and bumps her way back out. I just looked at him amazed and yelled, \"She does that too?!\" We had a good laugh. I love them anyways.","meta":{"section":"Cooking","utc":1496440331}}
{"text":"That makes a lot of sense. Thanks so much!","meta":{"section":"Cooking","utc":1560877196}}
{"text":"favorite thing to get at the butcher shop is fresh lard. a pound of salami lasts about 2 hours in my house. a pound of hot dogs is what...6-7 of them? eat two, eat two more on a different day, etc. bologna, just fry it up and eat it. I thought you were going to ask about pig knuckles or chicken feet or chitlins or something mysterious! The stuff you got you can just...eat. Or cook and eat. The steaks were the most complex item. Is the bologna a solid chunk, or slices?","meta":{"section":"Cooking","utc":"1421171083"}}
{"text":"This is the only response.","meta":{"section":"Cooking","utc":"1431483598"}}
{"text":"Slice them extra thin with a mandolin, sprinkle cinnamon, and proceed to win.","meta":{"section":"Cooking","utc":"1412524399"}}
{"text":"Ah yes I should have been more clear, i'm not considering this as a way to get around installing an extractor, I came across this water fryer and it piqued my interest so thought i'd ask if anyone has experience with it. I agree with your other points, it doesn't really seem that safe to me.","meta":{"section":"Cooking","utc":1562327069}}
{"text":"This one is much better. I bought a similar larger one from my local Asian market and it works a lot better than that. http://www.amazon.com/gp/aw/d/B007KPU242/ref=mp_s_a_1_5?qid=1407359679&amp;sr=8-5&amp;pi=AC_SX110_SY165_QL70","meta":{"section":"Cooking","utc":"1407359753"}}
{"text":"I would do a salad as first course (you can grab a premade one one) pasta sauce (just made an easy ricotta spinach sauce-google it!) with garlic bread (French bread, chopped up garlic and butter and put in oven-can add mozzarella if you like) and something easy and sexy for dessert (chocolate mousse or berries with whipped cream/ice cream). Keep it simple and she will happy! https://www.budgetbytes.com/2015/05/easy-spinach-ricotta-pasta/","meta":{"section":"Cooking","utc":1495654022}}
{"text":"Pour it on grape nuts.","meta":{"section":"Cooking","utc":1532692281}}
{"text":"Kenji Lopez is the shit, him and Chef John are my favorites","meta":{"section":"Cooking","utc":1469985157}}
{"text":"I made one the other day with brussel sprouts, bacon, shallots, and potatoes. Put a couple of fried eggs on top, and some spicy pepper sauce. Doesnt sound like much, but it was amazing.","meta":{"section":"Cooking","utc":"1438645108"}}
{"text":"I just use this. I can't be bother with graphs or pie charts. I get tired of trying to find things on them.","meta":{"section":"Cooking","utc":1485976077}}
{"text":"Slice, dry on racks in your oven at lowest heat. When dry dip in vinegar and pack in olive oil. Refrigerate, use to make tomato pesto.","meta":{"section":"Cooking","utc":1475369111}}
{"text":"To be honest, this is Farfalle &amp; Cheese. Not Mac &amp; Cheese. Mac refers to macaroni a type of pasta.","meta":{"section":"Cooking","utc":"1336633993"}}
{"text":"Is it wise to combine cabbage and tacos?","meta":{"section":"Cooking","utc":"1333903431"}}
{"text":"I live in a city with a local dairy, so I always get it from them. I'm not the biggest fan of milk, but I started using it a lot more once I moved here. And I have compared dates before, and the local is always better.","meta":{"section":"Cooking","utc":1481303626}}
{"text":"Massachusetts: Lobster(of course), preferably with mussels/clams","meta":{"section":"Cooking","utc":1563844967}}
{"text":"Ikea's quartz is Ceasarstone, and it's probably the best choice I made in my kitchen reno. It's always cool and cold, it's completely non-porous, doesn't require any maintenance, doesn't burn, doesn't scratch. Love it.","meta":{"section":"Cooking","utc":1499959376}}
{"text":"Montreal Steak Seasoning for the easy.","meta":{"section":"Cooking","utc":1531033367}}
{"text":"Pre-minced garlic isn't *terrible*, but it's not as good as the real thing either. The main difference I notice is the pre-minced stuff is usually a lot stronger, and real garlic is more mild and subtle (as subtle as garlic can be anyway).","meta":{"section":"Cooking","utc":"1333486830"}}
{"text":"I use a bit more heat. Also - a larger pan is easier to use to flip unless you have something with really small sides. This is because it's near impossible to get a spatula under the eggs nicely in a tiny pan. I use a smaller pan for scrambles or fried eggs, and a medium one for over easy. If you have a LOT of issues with flipping, just use a pan with a tight fitting lid. Add a splash of water and quickly close the lid. The steam will turn your Sunny Side Ups to more of an over easy egg.","meta":{"section":"Cooking","utc":"1360437014"}}
{"text":"This sounds fantastic. Definitely post the notes.","meta":{"section":"Cooking","utc":"1443186008"}}
{"text":"Its Fusilli Jerry!","meta":{"section":"Cooking","utc":"1433872010"}}
{"text":"We used to get cow's tongue sandwiches","meta":{"section":"Cooking","utc":1453847517}}
{"text":"Or an insensitivity. I get terrible cramps with peppers, because I have trouble digesting the skin.","meta":{"section":"Cooking","utc":"1386252614"}}
{"text":"I was making biscuits and gravy yesterday. I cooked my sausage patties as well as some crumbles for the gravy, I added the flour to make my paste, then I added the milk and it immediately started curdling. The milk had in fact soured. So, biscuits and honey for breakfast.","meta":{"section":"Cooking","utc":1541724306}}
{"text":"It would be good with any crispy form of potatoes, either roasted, fried, chips/fries. It could go well with pasta depending on what type of sauce it has an how big the pieces are.","meta":{"section":"Cooking","utc":1560954693}}
{"text":"This is BBQ sauce from a bottle, grocery store pizza dough, you admitted the cheese is not real cheese and the chicken's been on a boat all day. Why share a photo of this?","meta":{"section":"Cooking","utc":"1373258655"}}
{"text":"Bigos (aka hunter's stew) is one of those things that can be quick or slow. The longer it cooks, the more its flavor profile changes. An hour is plenty of time to have a serviceable meal on your plate. The pork would be cooked through, and while not pullable, it'd be reasonably tender. The sauerkraut would mellow out too. Leave it simmering for a day, on the other hand, and you're left with rich, tender mush to be eaten with a spoon. Crusty bread is a must-have either way. :-)","meta":{"section":"Cooking","utc":1448957191}}
{"text":"I feed the veggie leftovers/cuttings to my dog after I micro them. Not as good as your 'chips', but noteworthy for /r/frugal and healthy for dog as well","meta":{"section":"Cooking","utc":"1334771594"}}
{"text":"A Y vegetable peeler if you can't handle a mandolin.","meta":{"section":"Cooking","utc":1544381194}}
{"text":"Zucchini!","meta":{"section":"Cooking","utc":1490477509}}
{"text":"Instead of meat, potatoes and 2 veg, just leave out the potatoes. Substitute another veg dish like cauliflower cheese, steamed broccoli with sesame oil, mint peas, mushy peas, roasted parsnip, polenta or grits. If discrete bits of rice/grains is the problem, you could try various forms of sticky rice or dishes like paella or jambalaya where the rice is cooked together with the sauce . Indian cooking has various 1-dish curries, including potato or cauliflower. Saag aloo is a delicious potato, garlic and spinach dish. How do you feel about cottage pie, shepherd's pie, fish pie?, all of which are topped with mashed or scalloped potatoes. Potatoes dauphinoise is a nice healthy option (ahem). Potatoes Lyonnaise is delicious.","meta":{"section":"Cooking","utc":1465857409}}
{"text":"Good article. Thanks!","meta":{"section":"Cooking","utc":"1391145621"}}
{"text":"Maybe this is a dumb question, but is mirin or sake an acceptable substitute for the liaojiu? Or would that be too sweet.","meta":{"section":"Cooking","utc":1496178414}}
{"text":"The other variety of sauce you're probably thinking about is with salted plums. Also as you know this dish is a variant if the everyday dish of just steaming certain porky boney parts (not ribs) with minced garlic, black beans, soy sauce, rice wine, sugar, starch and oil.","meta":{"section":"Cooking","utc":1525817848}}
{"text":"It went from 3 stars - RECOMMENDED to 1.5 stars to RECOMMENDED WITH RESERVATIONS. Emerileware, Calphalon and Cuisinart are all recommended over Tramontina now. **Tramontina 12-Inch Tri-Ply Clad Fry Pan** ----------------- This updated 12-inch skillet from Tramontina has almost a wok-like bowl shape, and while the pan worked well for making crêpes, letting testers swirl the batter to an even thickness easily, its narrower 8-inch cooking surface was too small. It didn’t accommodate all eight pieces of a 3½-pound chicken and was a tight squeeze for two 12-ounce steaks. The brushed finish of the interior, another modification to the pan, was hard to clean after we seared steaks. http://www.cooksillustrated.com/equipment_reviews/1396-inexpensive-12-inch-skillets","meta":{"section":"Cooking","utc":"1412795761"}}
{"text":"> Actually talk to her about it in a calm, adult manner. Some people don't understand or care. I've asked my wife very nicely a number of times not to cut on the granite with the knives, and she always says she won't do it again, but it never changes. Soon, the knives will no longer be able to be sharpened any further so I'll just throw them all out and we won't have knives until she buys new ones. That will piss her off, but it might be the only way for her to understand that they have a lifespan, and using them on granite shortens the lifespan.","meta":{"section":"Cooking","utc":"1446004851"}}
{"text":"Tabouli with pita an baba ganoujh! For tabouli I prepare one cup dry bulgur wheat or quinoa, then dice up about five roma tomatoes, slice one bunch of scallions, mince 3-4 cloves garlic, chop ~2 bunches of curly parsley, about two tbsp fresh mint, then toss with the juice of three lemons and about 3-4 tbsp olive oil. Season with salt/pepper. Let it sit a few hours before serving. For baba ganoujh, quarter two eggplants, then rub with olive oil, season with salt/pepper, roast for ~45 minutes or until tender. Once tender, skin then mash the eggplant. Add ~1/2 cup tahini, juice of 2-3 lemons, some cumin, a few minced garlic cloves, then stir it all up. Season with salt/pepper to taste. Toast up some pita, spoon the baba ganoujh into the pita, fill with tabouli, then add some cucumber, maybe some falafel balls if you're feeling ambitious. I like to top with a simple home-fermented pepper sauce.","meta":{"section":"Cooking","utc":"1413879452"}}
{"text":"Don't worry fam, I got it","meta":{"section":"Cooking","utc":1479219327}}
{"text":"Isn't that kinda the same as saying this subs love of \"it probably needs more salt\" would be shilling too.","meta":{"section":"Cooking","utc":1522416571}}
{"text":"The wife and I had a hankerin' for curry this weekend. We decided to go all out and make the curry powder from scratch. We watched several cooks (including Manjula) and settled on Vah Chef. We went to the local Indian grocery and got all the whole spices (ridiculously cheap BTW) and roasted our first curry powder. It was so unbelievably good! We're making more on Wednesday! Just funny the coincidences.","meta":{"section":"Cooking","utc":"1420523049"}}
{"text":"> I wouldn't go as far as just leaving residual grease in the pan for next time. I never said to do that. You wipe the grease out and use a scraper to get off any stuck food bits. You can rinse with water if you need to but then you have to dry on a burner.","meta":{"section":"Cooking","utc":1553435467}}
{"text":"Tried to make a sauce with the rest of my IPA. Turns out once the water is reduced, all that's left is the oh so bitter biterness, who knew?","meta":{"section":"Cooking","utc":1524473146}}
{"text":"...or because of the (nitrogen?) gas they're pumping into the package to maintain the red color. If you see the \"don't trust the color of this meat, trust the Use By date\" sticker - that's why.","meta":{"section":"Cooking","utc":"1427827295"}}
{"text":"Uh... I dont think so... but now that you say that I am *terribly* curious.","meta":{"section":"Cooking","utc":1502117312}}
{"text":"Perfect! The food isn't sticking, but the oil was burning. I think it was a matter of not adding enough oil. I added probably a couple of tablespoons and would swish it around the pan instead of fully covering the bottom of the pan. Additionally, is it normal for the oil to smoke some? Usually right when I add the oil in the pan it starts to smoke. Thank you very much","meta":{"section":"Cooking","utc":1465234635}}
{"text":"I just put however much I want haha","meta":{"section":"Cooking","utc":1530209481}}
{"text":"Double Fry. once at lower temp to cook, second at higher temp to crisp","meta":{"section":"Cooking","utc":1548707644}}
{"text":"in my experience these things are easy to overcook and dry out. we always do a few minutes less than recommended, even! maybe your oven isn’t functioning properly?","meta":{"section":"Cooking","utc":1540991222}}
{"text":"god damn kermits, get dragged in there for a piece of pie which I love every time I'm in the keys then the gf spends the next hour shopping for shit i'm going to have to carry.","meta":{"section":"Cooking","utc":1559227189}}
{"text":"Thin crappy foil does.","meta":{"section":"Cooking","utc":1496097501}}
{"text":"Goodness gracious.","meta":{"section":"Cooking","utc":"1439154186"}}
{"text":"Throw some toasted walnuts, orange juice, and orange rind in there and you're gourmet as fuck","meta":{"section":"Cooking","utc":1476096482}}
{"text":"Hmmm... Yeah, the logistical issues of a giant souffle do seem very real. Is there something else chocolaty I might be able to make? Actually, thinking about it I wouldn't need to feed 20 people. Several of us go up a day so I'd really only need to feed a fraction of that.","meta":{"section":"Cooking","utc":1495049366}}
{"text":"Mirin. It has a tiny amount of alcohol in it but it's not something you would ever want to drink and it comes in tiny bottles so you wouldn't even get drunk if you drank the whole thing anyway.","meta":{"section":"Cooking","utc":1549002240}}
{"text":"Don't disturb/stir the batter after letting it sit in the fridge. Fluffiest. Pancakes. Ever!","meta":{"section":"Cooking","utc":1456342546}}
{"text":"I meant mirin, it's a japanese sweet wine cooking thing that adds a nice, light, delicate flavouring to shit. For example, I think a lot of the sweetness in sukiyaki comes from mirin. This is actually just my personal shopping list lol it's stuff I need RIGHT NOW but I don't have a car and the closest asian supermarket is pretty far :(","meta":{"section":"Cooking","utc":"1329593212"}}
{"text":"A little bit of cream cheese and a jalapeno slice or bit of green chile, fold, and fry 'em up. Yum!","meta":{"section":"Cooking","utc":"1407985022"}}
{"text":"Well North Carolina is mostly just your standard southern food. But there is a certain style of bbq with particularly vinegary sauce that's unique to this state. I'd suggest trying some NC BBQ.","meta":{"section":"Cooking","utc":1563819692}}
{"text":"Oh yeah, beef bones can withstand a long time. Google \" bone broth for more info. P.S. I second the tip to roast the bones beforehand.","meta":{"section":"Cooking","utc":1521330790}}
{"text":"Maybe use in a carbonara.","meta":{"section":"Cooking","utc":1489846378}}
{"text":"Pinterest","meta":{"section":"Cooking","utc":1514318896}}
{"text":"Were you guys poor? I don't understand how any normal person would think corn as the meal would be satisfying or filling.","meta":{"section":"Cooking","utc":1510813351}}
{"text":"They were a set for $60 and I trust the AC name and can't afford their stainless yet.","meta":{"section":"Cooking","utc":1455920064}}
{"text":"I'm on the fence. The only upside is that food doesn't burn on one side (if it has a rotating basket). The down side is it does take up a lot of space and a pain to clean after every use.","meta":{"section":"Cooking","utc":1557419506}}
{"text":"I don't have big enough of a pot thus I would need to boil it in about 3 batches without risking sticking or if I see they fall apart maybe even an hour.","meta":{"section":"Cooking","utc":1531402126}}
{"text":"When the fridge is looking pretty empty I'll whip up something I call Crazy Rice. Basically I'll take the odd bits of fresh vegetables or leftovers that I have then chop them up and sauté it all together. I put that mixture over rice and add an over easy egg or two. The yolk makes a bit of a sauce when you mix it all together. My favorite version had been ham, sweet potato, green pepper, onion and cheddar cheese.","meta":{"section":"Cooking","utc":1457381990}}
{"text":"eggs. eggs. eggs. Any kind of eggs. Basically breakfast for dinner.","meta":{"section":"Cooking","utc":"1435883629"}}
{"text":"Scallions","meta":{"section":"Cooking","utc":1533238719}}
{"text":"I know!","meta":{"section":"Cooking","utc":1539279004}}
{"text":"This is the kind of recipe I like. This I can do.","meta":{"section":"Cooking","utc":1498154280}}
{"text":"the devil's herb: cilantro.","meta":{"section":"Cooking","utc":1554162624}}
{"text":"The bones are totally okay to eat, and they have calcium. The crunch just weirds me out a bit.","meta":{"section":"Cooking","utc":"1441067579"}}
{"text":"Salted caramel baking chips. 100x better than mixing in mnms or chocolate chips.","meta":{"section":"Cooking","utc":1549073633}}
{"text":"Anywhere is a reasonable place to start if it seems tasty to you. Chicken Tikka Masala is arguably a British dish evolved for the UK Indian restaurant scene but it's using the same flavours and I don't think people should be slaves to authenticity.","meta":{"section":"Cooking","utc":"1348716457"}}
{"text":"Why does that work better?","meta":{"section":"Cooking","utc":1546034727}}
{"text":"do you ask for \"sushi grade\" at a locsal fish market? (not really a market, the ones near me are like small butcher shops for fish) is it an actual rating or would you just have to take their word that it's sushi grade?","meta":{"section":"Cooking","utc":1529446776}}
{"text":"Here's mine. No Crybabies Chili (Approximately 1 gallon) 1 lb. Beef stew meat or steak, NOT GROUND BEEF 1 lb. Pork stew meat or pork chops, NOT GROUND PORK 2-3 large jalapeno peppers (including seeds) 1-2 habanero peppers (including seeds) 1 large onion (yellow or white, not sweet) 1 large can Bush's chili beans (24 oz) (mild, or hot) 2 cans stewed tomatoes, NOT diced, crushed, chopped, or whole tomatoes (15 oz.) 3-5 cloves of fresh garlic Oregano Cumin Black pepper Cayenne pepper (optional) 2-3 bottles of your favorite beer (optional) Chop the meat into smaller pieces (~1 inch cubes), removing excess fat. Chop up the onion and Jalapeno peppers and garlic Open and begin drinking the first beer. Brown the peppers (only the jalapenos), onions, garlic, and meat in the pot you will be making the chili in. While the meat is browning, drain the tomatoes and chop them up (I put them into a large metal mixing bowl and use two knives to chop them. Using a blender or food processor it gets too watery) When the meat is browned do NOT drain, lower the heat to low-low/medium and pour in the tomatoes and chili beans (don't drain the beans) Stir well. By this time, the first beer should be gone, open and begin drinking the second. Add the pepper, cumin, oregano and cayenne pepper (if you use it) to taste. I use a lot of pepper and cumin, about 5 tablespoons and about 9 tablespoons of black pepper, very little oregano, maybe a teaspoon. Once the taste is right with the cumin, black and cayenne pepper, chop up the habaneros and add to the pot and stir well. Now it’s time to go and rest and give the meat, beans, tomatoes, onions, garlic, peppers and spices some time to get to know each other. Allow the chili to cook over low heat (uncovered) for as long as you want (at least 2 hours up to >5), stirring occasionally. If it starts to become too thick, cover it and continue to simmer. To make less hot (but why would you want to?!?), leave out or reduce the number of habaneros and/or jalapenos","meta":{"section":"Cooking","utc":1548089465}}
{"text":"Poach them in wine, serve over salad greens with a nice wedge of that brie and maybe a Dijon vinaigrette.","meta":{"section":"Cooking","utc":1450822806}}
{"text":"Ah, thanks. I write and read in English on the webz almost as much as I speak Italian every day, but sometimes I just don't know word or a how to express a concept and end up using an overly complicated metaphor instead ahah","meta":{"section":"Cooking","utc":1492027122}}
{"text":"Ok, tri-tip is the cut. First served in Long Beach in the early 50’s. Central Coast started cooking it over oak with a garlic rub and that’s the Santa Maria bbq. But it’s all over the state and rare outside it. In SoCal, it’s usually cooked more traditional bbq style (technically grilled) or Mexican flavors. I have never been in a supermarket, Costco, Whole Foods or butcher shop that didn’t carry it. If you grew up in Ca, you have had it in tacos, cook outs, bbq’s etc and didn’t realize it. Unless you were raised by vegans.","meta":{"section":"Cooking","utc":1563875666}}
{"text":"Hash. My husband just made us some this morning with bacon, potatoes, tenderloin tips, and some mushroom ravioli filling. All stuff we wouldn’t have been able to eat as a full meal on its own (except the potatoes I guess- that’s just a pantry item for us)","meta":{"section":"Cooking","utc":1556471315}}
{"text":"Leek soup is one of my all time favs, leeks/potato in even proportion, water, saltnpepper Also flour and deep fry they are killer","meta":{"section":"Cooking","utc":1550611932}}
{"text":"I go grocery shopping whenever I need something as opposed to setting aside a day to do bulk shopping. So if I'm going to make cod poached in tomatoes for dinner, that's what's on my list.","meta":{"section":"Cooking","utc":1528051081}}
{"text":"I love the goalposting here. Just take your opinions and fuck off, this isn't the place for your grandstanding.","meta":{"section":"Cooking","utc":1555042943}}
{"text":"Check out fruit sweet rolls - they're like cinnamon rolls but filled with fruit instead of cinnamon. My friend made a batch awhile ago and they were a big hit.","meta":{"section":"Cooking","utc":1543558162}}
{"text":"We are going with this plan. Glad to hear the pro's agree with us and I guess we will se in the next couple days when we get there","meta":{"section":"Cooking","utc":1532279085}}
{"text":"Fruit parfait with fresh fruit. Cut veggies with sour cream dipping sauce. Cold cut sandwiches. Bread dough to bake at home with parents. S'mores. Salad dressing for salads.","meta":{"section":"Cooking","utc":"1384096897"}}
{"text":"Have you tried roasted brussel sprouts? I hated them before, but found they just weren't being prepared in a good way. Cut each sprout in half, toss with red pepper flakes and extra virgin olive oil, roast at 375 with garlic until tender, about 40 mins. Delicious!!","meta":{"section":"Cooking","utc":"1336922859"}}
{"text":"It's not gonna melt the steel or anything but the abrasives in dishwasher detergent will absolutely *wreck* the edge of the blade.","meta":{"section":"Cooking","utc":1562521398}}
{"text":"Thanks!","meta":{"section":"Cooking","utc":1457045457}}
{"text":"Sounds like too much water might be the culprit, then. Are you using just enough to cover the bones or more than that?","meta":{"section":"Cooking","utc":"1441298340"}}
{"text":"Depends on the style. Hop forward beers lose a lot of flavor if they aren’t fresh. Malty or high alcohol beers fare somewhat better. Cans or bottles? Bottles are more likely to oxidize in which case dump it, it will taste like moldy basement. Cool or warm storage? Cool storage is better for the shelf life in general. If it’s worth saving, just taste it and see what you think. Even expired it won’t be unsafe to drink, just may not taste very good. If it tastes ok, use it for deglazing or just drink it.","meta":{"section":"Cooking","utc":1547591621}}
{"text":"The idea is to end fermentation prematurely so that its soda/pop/coke and not an alcoholic beverage. He'd only need to add more sugar if all of the previous sugar had been fermented out, in which case this wouldn't be soda anymore.","meta":{"section":"Cooking","utc":"1355166539"}}
{"text":"I myself love that smell...I'm sorry that it affects you like that","meta":{"section":"Cooking","utc":1555821089}}
{"text":"Ive been told that rinsing chopped onions before storing does well for them. Its apparently what thr food suppliers do. Garlic can be chopped or minced and stored in oil. Carrots can be peeled and stored in containers in water in the fridge. Though as someone stated previously, in a proffesional kitchen this type of work is generally trivial and if you need to prep all this just to do one meal or such well, you wont last long.","meta":{"section":"Cooking","utc":1547239121}}
{"text":"I came in here looking for an ant recipe, and you, ma'am, did not dissapoint. Bravo!","meta":{"section":"Cooking","utc":1516592459}}
{"text":"I'm going to have to try this and compare it to my brother-in-laws tacos. Maybe I can hang with the big tacos.","meta":{"section":"Cooking","utc":"1432857759"}}
{"text":"... but they're supposed to stick a little. I mean, it's right in the name. IMO, stainless steel seems to give them the best caramelized bottoms.","meta":{"section":"Cooking","utc":1497499550}}
{"text":"Yeah we laughed about that. Cool to see how they made them.","meta":{"section":"Cooking","utc":"1346858534"}}
{"text":"my dad always told me to put a couple ice cubes on a tray on a lower rack than your bread to give you perfectly crispy crust. I don't make bread but he does it every sunday and its really flippin' good so I'd take his word for it.","meta":{"section":"Cooking","utc":1459054591}}
{"text":"As much Brie as I could possibly carry.","meta":{"section":"Cooking","utc":1458114735}}
{"text":"I base it off what I have or want to eat. A simple google and scroll through of a couple relevant recipies, and then just base what I cook off that. I dont actually follow a recipie, just gets me going in the right direction. I know the tastes of those I cook for and my own, as well as what I have on hand/ what needs used up. Ill modify and vary from there. I dont really care about authenticity, I just want good food and dont want to waste any ingredients.","meta":{"section":"Cooking","utc":1531226293}}
{"text":"Chilli in a slow cooker.","meta":{"section":"Cooking","utc":1543900125}}
{"text":"🤦‍♂️ 😂 😎😘","meta":{"section":"Cooking","utc":1559326034}}
{"text":"This may be unpopular, but I have a few Mercer knives (which I purchased from ACE Restaurant Supply in ATX) and I LOVE them. They're affordable and perform well. Maybe not 100% balanced but really good for the price. ETA: The knives I have are from the Genesis line. Dig 'em.","meta":{"section":"Cooking","utc":1472181836}}
{"text":"Since you asked about both: In my charcoal grill - I like lump charcoal. It burns hotter and faster but that’s not a bad thing. In my BBQ - Kingsford charcoal briquettes. They’re easy to light and burn forever, so I don’t need to keep adding more. Also they don’t burn as hot so it’s easier to keep a good smoker temp for low and slow.","meta":{"section":"Cooking","utc":1532990487}}
{"text":"Bread isn't a sandwich ingredient though. If you asked for a pizza with one topping you wouldn't just get a pile of pepperoni in a box, so a one ingredient sandwich isn't just a bap.","meta":{"section":"Cooking","utc":1499188507}}
{"text":"Really nice! Beautiful.","meta":{"section":"Cooking","utc":"1404324083"}}
{"text":"You have to be pragmatic about it as well. Someone who scarcely knows anything about mycology still can probably tell the difference between a pored mushroom, and one with gills. What's the worst fate you can meet by consuming the wrong bolete or suillius? You shouldn't out of principle, but it's pretty much always going to be safer than foraging for, say, a blusher, or even oyster mushrooms - no matter how much of an expert you are.","meta":{"section":"Cooking","utc":1547863732}}
{"text":"Wow, those are the most disgusting greaseballs I have ever tasted, 0/10.....","meta":{"section":"Cooking","utc":"1434055493"}}
{"text":"Despite the shockingly low resolution, that video, with several pauses and rewinds, taught me how. Most videos about \"deboning chickens\" really mean breaking it down, not removing all the bones but leaving it whole for a ballotine.","meta":{"section":"Cooking","utc":1483928538}}
{"text":"> Especially now that we have so many latinos in the US. Wait, what?","meta":{"section":"Cooking","utc":1553276227}}
{"text":"Once you boil the gravy it'll be fine. That said, flavor-wise that marinade doesn't look like it'll be ideal as a gravy for sides. Too sweet with the sugar and bourbon. It would probably convert into a pretty good BBQ sauce/glaze though.","meta":{"section":"Cooking","utc":1560444933}}
{"text":"Mojitos! Lime juice, mint, white rum, simple syrup, seltzer, ice.","meta":{"section":"Cooking","utc":"1415490218"}}
{"text":"Pro here. Hell yes we use them for almost all of our Mise en Place. Total lifesaver.","meta":{"section":"Cooking","utc":1473479928}}
{"text":"I too love Italian food.","meta":{"section":"Cooking","utc":1494499600}}
{"text":"Can't lose either way. If I go somewhere for a lobster roll and all they have is Maine style, it's not like I'm going to not order a lobster roll.","meta":{"section":"Cooking","utc":1544029159}}
{"text":"I have a 36” glass cooktop, $800 on sale. It’s pretty fancy, and pretty.","meta":{"section":"Cooking","utc":1546685018}}
{"text":"I love heavy cream in coffee too.","meta":{"section":"Cooking","utc":1548688659}}
{"text":"Fuck y'all! I'm out!","meta":{"section":"Cooking","utc":1554190810}}
{"text":"Haha that's awesome! I love both kinds of dip, and I love how everyone puts their own spin on it. I like to do half ranch / half blue cheese dressing, or just ranch + blue cheese crumbles. I've also had it with canned chicken and with rotisserie, both were surprisingly good. At my former job I was super excited when someone brought it in for a potluck. I'd never had it before then and was like *\"What is this marvel of deliciousness?!?\"* After the potluck was over I asked if I could take a little cup home with me, and then packed some in a disposable coffee cup covered with napkins just so I could eat it later with chips for dinner, haha. It's surprising the neat tasty dishes you find at potlucks you never thought of trying. One I had was grape salad with butterfinger pieces (weird but really good), and another was doritos corn dip. As a fellow buffalo dip lover, I'd hug you too if you brought it to a party, haha!","meta":{"section":"Cooking","utc":1548556218}}
{"text":"NJ porkroll egg and cheese on a Kaiser roll. Egg has to be runny.","meta":{"section":"Cooking","utc":1563826627}}
{"text":"Sure thing, here is the recipe for a single drink: * 1 egg white * 2 oz earl grey infused gin (see below) * 1 oz simple syrup * 1 oz lemon juice Add all ingredients plus some ice in a bar shaker, shake vigorously and then pour into your martini glass, careful to ensure that no ice gets in. For the gin, you literally steep earl grey tea bags inside a bottle of gin. For a 26oz bottle, I usually use 4 tea bags and let it steep for around 4 hours. After that, strain the gin to remove the tea bags and then pour it back into the bottle. The recipe was obtained from a local bar, and these are the specific tea bags they use (and that I use too since the difference between them and a normal earl grey is very noticeable).","meta":{"section":"Cooking","utc":"1353188644"}}
{"text":"Yeah my parents got the hot and sour soup, and couldn't finish it. And my stepdad LOVES spicy shit. Red Pearl is really good though.","meta":{"section":"Cooking","utc":"1392086714"}}
{"text":"Stock cubes are used in restaurants more than you'd know.","meta":{"section":"Cooking","utc":1548121708}}
{"text":"WELL FUCKING SAID","meta":{"section":"Cooking","utc":"1329196397"}}
{"text":"I really only use unsalted butter for baking where it is much more important to be able to control your salt content because it is more difficult to recover from. I don't use much salt at all in dishes I cook that contain butter so I don't need to keep two kinds of butter in my fridge.","meta":{"section":"Cooking","utc":"1432567612"}}
{"text":"ok...bump up the oil to be olive oil and kick up the oven temp to 450...make sure the potatoes are DRY DRY DRY well patted dry after you sliced them super thin on a mandolin. Slice them into ice cold water so they don't turn brown and lose some starch, and then lay them out on paper towels and roll them up and squeeze out that water...then unroll, lay on a sheet tray and spray liberally with olive oil to coat them well and season..then bake at 450F for about 20-25 min turning your rack once half way.","meta":{"section":"Cooking","utc":1549568762}}
{"text":"I'm from Ontario. If we only ate seasonal fruit/veg everything we ate all winter would be pickled or preserved which would get old after a while. A lot of our food comes from California, all year round which is a little weird because we have some excellent farm land but most of it seems to go to corn.","meta":{"section":"Cooking","utc":"1336966683"}}
{"text":"Roasted Garlic. Instead of roasting whole or cut heads of garlic, take peeled garlic cloves, put in small oven proof pan and just barely cover with oil. Roast in oven covered with foil 15-20 min 350. I find when I used to roast the actual heads that it was difficult to squeeze all the garlic out of the peel. I have found this to work much better.","meta":{"section":"Cooking","utc":"1344806167"}}
{"text":"I have the larger model same color..you will miss it - it is wonderful..","meta":{"section":"Cooking","utc":1516752952}}
{"text":"it's a good solution for everything!","meta":{"section":"Cooking","utc":1543062584}}
{"text":"Aioli is a great idea!","meta":{"section":"Cooking","utc":1561939551}}
{"text":"> He has all the necessary tools to heat, treat, and cut metal. Just bear in mind that \"cutting metal\" is a very broad topic. I used to work in an aerospace machine shop with a $10,000 bad ass band saw I'd used to cut through part of an aluminum engine block once... and I probably wouldn't bother trying to saw through a kitchen knife, short of buying some really good (and likely expensive) blades. Especially if he's only been doing this stuff for a year or so. Things that work great for aluminum don't do as well for mild steel. Things that work for annealed alloy steel don't fly for hardened, etc. See how it goes...","meta":{"section":"Cooking","utc":1505146993}}
{"text":"Maangchi. Her hotteok recipe, among many others, is the real deal. And very accessible.","meta":{"section":"Cooking","utc":1484285678}}
{"text":"We would use decigram but much less often, deciliter though is the standard but we use centi and mili regularly as well.","meta":{"section":"Cooking","utc":1466729414}}
{"text":"Safety issues aside from using straight alcohol in a pressure cooker, I just can't imagine that's going to taste very good. It's going to be soooo boozy... I could be wrong though, so don't let us dissuade you from trying it. Assuming it's safe, what the worst that could happen? You ruin a few ribs and waste a bottle of brandy. Do it in a dutch oven to be safe, and let us know if it worked!","meta":{"section":"Cooking","utc":1465578488}}
{"text":"From much the same back ground myself and our secret was a lot of black pepper and a few shots of hot sause as the beef mix is cooling we also added butter the same time the cabbage goes in.","meta":{"section":"Cooking","utc":"1430335032"}}
{"text":"Yuuussss but i think that recipe calls for a bajillion spices, no?? :(","meta":{"section":"Cooking","utc":1551420234}}
{"text":"it's also lethally toxic in large quantities.","meta":{"section":"Cooking","utc":"1353982828"}}
{"text":"Cauliflower. My parents used to steam it and it smelled like rotten farts. Then I tried Indian crispy cauliflower (Gobi 65) and my whole world changed.","meta":{"section":"Cooking","utc":1546368079}}
{"text":"I went a restaurant before and one of the side dishes was this AMAZING carrot puree/mash. Maybe you could look up some of the recipes? I loved it a lot but have yet to find something that is exactly the one in the restaurant.","meta":{"section":"Cooking","utc":1520700482}}
{"text":"Here is what I use! I'd add more pasta though, I like it to have a lot of sauce. If you didn't want to bake it, just cook the cheese sauce for longer, and make sure the pasta is cooked through before adding it. 2 cups macaroni 1/4 cup butter 1/4 cup all purpose flour 3 cups 2% milk 3/4 tsp salt 1 1/2 tsp worcestershire sauce 2 cups shredded old cheddar Cook macaroni (not all the way! make sure its al dente), rinse and drain well. Melt butter in large saucepan on low heat. Whisk in flour, stirring until smooth. Gradually stir/whisk in milk, slowly so you don't get clumps. Heat, stirring constantly, until mixture comes to a boil and is thickened. Remove from heat. Stir in salt, w sauce and cheese, until cheese melts. Add macaroni and mix well. Put in a greased 3 litre casserole. Bake at 375F for 30 minutes or until hot and bubbly. Don't let it sit too long after that or it goes a bit stoggy. Makes 6 servings. . I add this topping before baking. 1 small onion, finely chopped. Saute in a bit of butter @ low for about 5 min's, until very soft. Add 1 tsp dijon &amp; 1/4 tsp freshly ground pepper. Cook &amp; stir 1 min. Remove from heat. Mix in 2/3 cup breadcrumbs (Panko, Japanese ones, are the best), 1 1/2 tbsp finely chopped fresh parsley and 1 1/2 tbsp parmesan. Sprinkle over macaroni and then bake.","meta":{"section":"Cooking","utc":"1423066363"}}
{"text":"I like my \"oatmeal\" made with ½ steel cut oat and ½ kasha, aka roasted buckwheat. The difference between steel cut and rolled oats is that the former has texture and flavor and adding buckwheat gives it even more of both. Generally 1 part grain to 4 parts water. I cook for myself and one serving is ¼ cup grain to 1 cup liquid, but use common sense. For instance, If you're adding a whole banana out of the freezer use less water because there's a lot of liquid in the banana. If you're adding dried blueberries or dried tart cherries use more water cause the dried fruit will absorb water. For sweet oats, I add 1 teaspoon sweetener per serving, usually brown sugar, maple syrup, or honey; usually toss in a teaspoon of cinnamon too. If I'm making savory ~~porridge~~ oatmeal I brown the sausage and sauté the onions, garlic, and hot peppers first. I use a double boiler because there is no chance of burning and I don't have to watch it or even stir. Just set a timer for 40 minutes and forget it. I don't have a double boiler so what I mean is I put a good quart of water in a 1.5 qt. pot and put the oats in a covered 3-quart mixing bowl on top of the pot. By the way, everthing written above applies to grits too. &amp;#x200B;","meta":{"section":"Cooking","utc":1544821511}}
{"text":"Empanadas are also good. You can make the \"rim\" really thick so they can hold that while they eat, then chuck it when they're done, so they don't need to eat something they've just been holding with dirty hands.","meta":{"section":"Cooking","utc":1474761673}}
{"text":"This looks amazing...have you tried it?","meta":{"section":"Cooking","utc":"1424011509"}}
{"text":"Using all purpose flour in place of bread flour will give you a denser loaf. Adding fat to a basic FSWY recipe can also affect density.","meta":{"section":"Cooking","utc":1547401004}}
{"text":"Celery seed!","meta":{"section":"Cooking","utc":1525979983}}
{"text":"$430 a month on food is a nice budget for one person, including snacks and so forth - but you need to learn to work with leftovers. Either enjoying them as leftovers or learning to reuse them. Some of my standard meals during the course of a week include a whole roasted chicken (roasted chicken and veg the first night, then sandwiches for lunch, then maybe chicken tacos or chicken enchiladas the next night [with leftovers of that for the next lunch], then make stock from the carcass for using in other meals. I also do a lot of big pots of soup, stew, or chili that can be either eaten on for a couple of days or you can make double or triple batches of some things and then freeze them for later in the week or month (keeps me from getting tired of the same thing over and over). And I have to admit for a fondness for old-fashioned tuna noodle casserole (with homemade mushroom sauce) with frozen veggies in it. It also serves well for a couple of meals at a minimum and some leftovers you can freeze and nuke for later. Being willing to do a few veggie or low meat meals will help keep costs down as well. Make a pot of beans and rice or a veggie stir fry (or one with very little meat added). Breakfast for dinner can be cheap and really delicious, too. Speaking of breakfast, get away from cereal since it's expensive. I love steel cut oats in the winter - they're a little more expensive up front, but a 1/4 cup expands in a cup of water to make a nice serving, and when topped with cut up fruit, it's a good bit of food. Or mix oats with a little cheese and top with a fried or poached egg for a savory version. One thing I do that saves money is wait until chicken breasts go on sale for some ridiculously low price. Then I'll buy a bunch and poach them in water that has a big scoop of taco seasoning in it. Shred them and then freeze them in 2 serving packets. That chicken can be used in enchiladas, tacos, nachos, any type of Mexican dish you want, and it's pre-cooked and ready to go. Avoid prepackaged snacks and things that are in \"single serving\" sizes. They actually wind up costing more per serving. Obviously don't buy in bulk if you don't have a way to freeze/preserve things, but there's a balance between the two. I think on your budget you could have some great meals. Good luck.","meta":{"section":"Cooking","utc":1449018865}}
{"text":"Okra a little over has a really nice texture and taste. I’m not surprised it’s cooked in this manner. So tasty.","meta":{"section":"Cooking","utc":1554510158}}
{"text":"Agreed. I have friends who bbq religiously, one who has a love affair with his smoker. All agreed my slow cooker ribs hold their own against the rest.","meta":{"section":"Cooking","utc":1532121740}}
{"text":"Mortar and pestle. That thing takes a fucking beating. We're vegetarian, so hummus, guacamole, moles (not THAT kind of mole), pesto, random dry spice mixes are on order alllll the time. It gets a deep pounding at least twice a day.","meta":{"section":"Cooking","utc":1519059112}}
{"text":"Why buy a set in the first place? Buy the pieces you need. Buy all clad pots and sauté pans. Buy cast iron skillets and a high end non-stick pan like Swiss diamond. Buy le crueset Dutch ovens and get as much copper as you can afford. No one company makes the perfect set. Get the best you can get, one piece at a time and your gear will last for decades.","meta":{"section":"Cooking","utc":1507905416}}
{"text":"I actually love garlic powder.","meta":{"section":"Cooking","utc":1556764992}}
{"text":"Oh my gosh how did I never think of this? I love red onions pickled in red wine vinegar. Thank you for this suggestion.","meta":{"section":"Cooking","utc":1482896081}}
{"text":"Shut her down","meta":{"section":"Cooking","utc":"1435899908"}}
{"text":"Edit: I'm glad to hear that you got most of it sorted out! I'd make a ton of soups and stews, and freeze those again. They'll last a while and its a way to make sure the meat all gets thoroughly cooked. You can do chicken/turkey noodle soup, sausage and bean soup, etc... For the pork, you could make pulled pork and freeze it in portions for sandwiches. You could grill some of the chicken to have on salads. If you don't have too much shrimp, I'd use that right away to make a scampi, or grill them on skewers.","meta":{"section":"Cooking","utc":1531333598}}
{"text":"Thanks, this is exactly what I'm looking for. Now I'm looking for something on detail. For instance cleaning the counter often it is not good enough to use a dish cloth that was previously used to wipe a surface that was used to chop chicken. Especially if it was yesterday. I'm going to send that document over as a start....","meta":{"section":"Cooking","utc":1561906326}}
{"text":"OP, are you... a troll?","meta":{"section":"Cooking","utc":1535184424}}
{"text":"Anywhere you would normally use a chicken egg. They are a bit larger and the yolk a bit richer, but really not much difference from high quality chicken eggs. I think they really shine in an over easy egg with toast.","meta":{"section":"Cooking","utc":1535248780}}
{"text":"And also, epic gas.","meta":{"section":"Cooking","utc":"1351098536"}}
{"text":"This made me laugh so hard thank you! It's something I totally would have done in the past.","meta":{"section":"Cooking","utc":1550696399}}
{"text":"Could you give some specifics as it relates to nutritional value and conventional vs organic produce? For example, when testing broccoli would the vitamin and mineral makeup be equal across both conventional and organic stocks? Thanks man. I've been interested in this for a while but haven't really come across any scientific data sets","meta":{"section":"Cooking","utc":1556542323}}
{"text":"Yup, traditional Spanish chorizo. Our fastidiousness meant that we sought out oak smoked chorizo without any sweeteners (so it only contained cured pork, pork fat, salt and paprika). It cost us about £4.50 for 300g, but so worth it!","meta":{"section":"Cooking","utc":1559309884}}
{"text":"This book changed the way I thought about cooking.","meta":{"section":"Cooking","utc":1559561364}}
{"text":"Whole wheat pasta has a very different consistency but when I tried the cold pan method with normal pasta it was way mushy.","meta":{"section":"Cooking","utc":"1426358426"}}
{"text":"Thia is little off the block but it is insanely good. I've made this three or four times and leftovers don't happen. It is a recipe for the Cochon Butcher's (New Orleans) panchetta mac n cheese. Their mac is known nationwide as one of the best. Be warned- its not cheap, but its killer (costly because it has items such as mushrooms, leeks, celery, shallots, white wine, tomato paste, several herbs)...http://lickmyspoon.com/recipes/pancetta-mac-n-cheese/","meta":{"section":"Cooking","utc":"1446518976"}}
{"text":"I save all the trimmings from practically everything, onion roots, carrot tops, celery, herbs and particularly the silver-skin and grizzle from meats in a zip lock in the freezer. When I have two or three full I make a stock of mixed beef pork. I usually add some neck bones, marrow bones and maybe ox-tail to ensure I have enough gelatin. I boil, and then simmer it. I turn it off if I need to leave the house, or sometimes overnight, until everything is just boiled to falling apart. Then I strain it, and cool it, pour it into jars with lids and pressure cook it for and hour or more. It lasts for months (unrefrigerated). The result is a thick rubbery jello that melts with just a little heat. It adds great mouth feel to soups and sauces (It sets in layers, so for delicate sauces you might want to spoon your favorite layer out of the jar). Much better than broth.","meta":{"section":"Cooking","utc":1554592639}}
{"text":"Glad i scrolled down to upvote this. It was a hard lesson for me to learn to not salt anything else but the dish itself WHILE making it. Now i do not use salt for seasoning food on a plate ever.","meta":{"section":"Cooking","utc":1562632596}}
{"text":"oh i was actually thinking about hooking up the 2l bottle with the faux caviar device, making that way a lot more in a lot less time..","meta":{"section":"Cooking","utc":"1345934734"}}
{"text":"I'm in the midwest, tuna noodle casserole is still a thing.","meta":{"section":"Cooking","utc":"1421450416"}}
{"text":"Sorry but... I. HATE. Cooked. Carrots...","meta":{"section":"Cooking","utc":"1343188453"}}
{"text":"Maybe a sandwich, like a roasted turkey club (actual roasted turkey, not deli-sliced), BLT, grilled-cheese or a panini? Maybe Roasted vegetables, along with rice cooked in chicken broth. Maybe a lighter, non-tomato Italian main course, like a noodle covered in a lighter sauce made from wine and sauteed mushrooms. Mexican dishes tend to go well with chicken soups.","meta":{"section":"Cooking","utc":"1422921723"}}
{"text":"I was thinking that Idaho would be plain cos I couldn't think of anything, but forgot this classic assemblage, because I figured it was a national meal. Had me some elk burgers last night and got a fresh jar of huckleberry jam from my aunt. Love being Idahoan.","meta":{"section":"Cooking","utc":1563860317}}
{"text":"More information? You could spend years reading all the research into food safe plastics that's available now. How much more could you want?","meta":{"section":"Cooking","utc":1465864635}}
{"text":"You can just eat them by themselves. That's how I usually eat them. You could probably make a pretty good syrup from them and use that for various applications such as drinks or desserts","meta":{"section":"Cooking","utc":1486492073}}
{"text":"I didn't know that was a thing with the ragu. If I'm feeling especially lazy I'll just crumble a stock cube directly into the sauce and pour some tap water in, then stir it all up.","meta":{"section":"Cooking","utc":1462200750}}
{"text":"Nice! Thank you! I would be afraid of the flip, does it not break the yolk?","meta":{"section":"Cooking","utc":"1340402716"}}
{"text":"Reading all of this has stressed me the f out.","meta":{"section":"Cooking","utc":1546626986}}
{"text":"Personally i think the old adage of 'you get what you pay for' is relevant when purchasing a kitchen/chef knife. If you want a knife that is good quality and will last you for years as opposed to months then you need to stay away from your $25 knives. For me, the Sabatier four star elephant knives are the best! Ive heard many stories of 20-25 year old Sabatiers that are as good now as they were back then. They have a basic range and more aesthetic ranges too such as stamina handles, olive wood handles etc. I get mine at http://genuinesabatier.com they have good service and don't charge shipping either!","meta":{"section":"Cooking","utc":"1422987107"}}
{"text":"Double strength vanilla.","meta":{"section":"Cooking","utc":"1416070527"}}
{"text":"For someone who didn't start as a saucier, is suggest starting with bread. Alton Brown has a good video on it, or look up, \"no knead bread\". Your journey will begin on its own from there","meta":{"section":"Cooking","utc":1488670186}}
{"text":"A few months ago I whipped up something out of some vegetables and chicken that I needed to use up before they went bad. It was more or less made up on the fly, but came out unexpectedly good. First, sliced onion, red and green bell pepper, and tomatos from a can were arranged on a baking sheet, brushed with oil, salt, and spices, and roasted in the oven. The chicken was also brushed with oil, salt, and seasonings, and browned in a hot pan. Once browned, the chicken was removed and the heat lowered, and some minced garlic and anchovies were sweated in a little oil. Then I added beef stock, the liquid from the can of tomatos, some tomato paste, and let that come to a simmer to reduce. The liquid was then further thickened with a cornstarch slurry, the roasted vegetables and chicken were added to the pan, and the whole thing continued to cook for maybe 10-15 minutes longer. I served it over rotini pasta.","meta":{"section":"Cooking","utc":"1447724030"}}
{"text":"Witchcraft, aka perfectly logical explanation.","meta":{"section":"Cooking","utc":"1370288973"}}
{"text":"> Both of which make a steak tasty and are two things I use on every piece of meat that I cook. That's the thing I take issue with. I don't add all that stuff to every piece of meat I cook. I use a moderate amount of salt on a really nice steak - that's about it. MSG seems a bridge too far.","meta":{"section":"Cooking","utc":1525704939}}
{"text":"There's a link to return to the original blog post to get the instructions when you're actually cooking this recipe.","meta":{"section":"Cooking","utc":1529425392}}
{"text":"you could make spaghetti pie, or baked spaghetti?? Spaghetti pie is pretty simple but way delicious. make spaghetti. sauce the noodles. using 2 cups of leftover sauced spaghetti put it in a medium sized bowl. Add 2 eggs, 1/4 cup each mozzarella and parmesan cheeses, and a pinch or more of red pepper flakes if you like them. and stir well. Heat an 8\" skillet over medium hight heat; then to your skillet add a tablespoon or two of olive or canola oil. get it good and hot swirl to coat. &amp;#x200B; Add the spaghetti mixture. Using the bottom of the measuring cup press the mixture down tightly into the skillet. let this cook and brown until it is well caramelized on the bottom. Then using a plate, lay it over the top of the skillet and turn the skillet upside down on to the plate. set the plate down, put the skillet back onto the heat. add more oil to the skillet swirl to coat and slide the uncooked side of the spaghetti pie back into the skillet. let the second side cook until it is also browned and caramelized. Serve with extra sauce and some garlic toast if you can. &amp;#x200B; Now this pasta is the bawm! you can eat as a side dish or add any protein and make it a meal, it keeps very well in the fridge. https://www.copymethat.com/r/kq02YKI/orzo-with-caramelized-mushrooms-and-wilt/ &amp;#x200B;","meta":{"section":"Cooking","utc":1554302053}}
{"text":"Stop him he's being reasonable!","meta":{"section":"Cooking","utc":"1393806701"}}
{"text":"Bro.","meta":{"section":"Cooking","utc":"1439353296"}}
{"text":"To make chicken breast taste delicious, you need to put all sorts of crap on it. To make chicken thighs taste delicious, you need only add heat. Maybe throw some rosemary and lemon on there to mix it up.","meta":{"section":"Cooking","utc":1477033051}}
{"text":"The time was probably the issue then because I did almost exactly what you did. Thanks!","meta":{"section":"Cooking","utc":1563931718}}
{"text":"Yeah. the Magnus episode was amazing. I'm strongly considering that for a future vacation.","meta":{"section":"Cooking","utc":"1431187093"}}
{"text":"See that's the difference between us. I took these suggestions seriously and the ones I haven't already tried I will make a point to do so. You on the other hand ignore my suggestion and even claim it's inferior while refusing to try it. To top it off you are making assumptions about my character in the most hypocritical fashion. Also. What the fuck? Who said anything about celery not being classy? Jesus, Lady we all know you get wet for celery, but vegetables aren't classy.","meta":{"section":"Cooking","utc":1530546340}}
{"text":"I feel like this question is more \"what staples do i buy\". I would suggest buying 1 new 'pantry' item every time you make a dish. If i had to 'limit' my pantry, the must haves would be.. roughly in this order.. Salt, cayenne, cumin, flour, baking powder, thyme, Italian seasoning, black pepper, garlic powder, brown/white sugar, whole canned tomatoes, chicken broth, beef consomme... That should give you a jump start on making tacos, french onion soup, spaghetti, most importantly several different variations of the same \"meat in pan, sauce and veggies, starch on side\" one pan meals, chicken wings, and lots of baked goods","meta":{"section":"Cooking","utc":1475290576}}
{"text":"It's great as an ingredient. It just doesn't stand on its own.","meta":{"section":"Cooking","utc":1512927964}}
{"text":"If you could have any one food for the rest of your life, what would it be and why is it spaghetti?","meta":{"section":"Cooking","utc":1463490550}}
{"text":"ive made a roux plenty of times ive never had one take this long i used the oil first to cook my shrimp and sausage in it first idk if that caused an issue or what the deal it but i think ill just re try","meta":{"section":"Cooking","utc":1551225975}}
{"text":"Uhh yeah, but the sausage has to be made with the meat of another exotic animal... ...like Panda","meta":{"section":"Cooking","utc":1504842912}}
{"text":"Like MathFlakes said, and sometimes they are a little smaller, like 1/2 or 2/3 width. Mine also cooked overly hot, which I loved, because I mostly cooked pizzas and baked potatoes in it. I miss that little guy.","meta":{"section":"Cooking","utc":"1429225933"}}
{"text":"Wow when your Manufacturing you learnt in Uni last year actually comes back in real life! That's a good knife dude. Low carbon for bending? I think that's low carbon amirite, 0.5-2%? Anyway nice composition","meta":{"section":"Cooking","utc":1504724559}}
{"text":"No, you can't cook a tough cut like a leg like that. You want to make carnitas, which is slow cooked to render the fat and gelatinize the connective tissue then broiled to crisp it up.","meta":{"section":"Cooking","utc":1562602138}}
{"text":"> I would probably get another piece if le Creuset. For $100 from William Sonoma? Are you talking stone ware?","meta":{"section":"Cooking","utc":"1380206666"}}
{"text":"also be careful with boiling vinegar, you absolutely want to open the pot away from yourself.","meta":{"section":"Cooking","utc":1542337751}}
{"text":"Yeah I agree that it's way too salty to be very enjoyable on its own like parm is, but I love it in pasta (might even take it over parm if I *had* to pick one grating cheese for the rest of my life)","meta":{"section":"Cooking","utc":1563101562}}
{"text":"New Mexico: Enchiladas! BUT I highly suggest that you use authentic New Mexico green and/or red chile because that truly is what makes a dish New Mexican.","meta":{"section":"Cooking","utc":1563825290}}
{"text":"My electronic scale was super annoying it seemed to require new batteries every other time I used it.","meta":{"section":"Cooking","utc":"1412733108"}}
{"text":"That’s incredible. What other stuff did they have?","meta":{"section":"Cooking","utc":1558795599}}
{"text":"I also want the inside to be dry, which is something that would be hard to achieve with deep frying.","meta":{"section":"Cooking","utc":1546005180}}
{"text":"If you buy shrimp with heads and shells on, you can make a very nice shrimp stock and use that to make your rice to infuse it with shrimp flavor. You could also eat the heads- they're full of delicious goo","meta":{"section":"Cooking","utc":"1432827259"}}
{"text":"Serious Eats has a test kitchen, so does Epicurious/Bon Appetite. Right now BA is doing a series on making perfect pizza.","meta":{"section":"Cooking","utc":1557152434}}
{"text":"Yeh, that could be a problem. For a larger family it's more realistic to go through 5lb of grapes in 10 days.","meta":{"section":"Cooking","utc":1534443304}}
{"text":"Ha! That's awesome!","meta":{"section":"Cooking","utc":"1432477338"}}
{"text":"And vinegar - something refined like sherry if you just want one but I keep a bunch for different uses","meta":{"section":"Cooking","utc":1473350618}}
{"text":"I've found substituting a different grain (such as rice or quinoa) is much tastier than egg noodles. Also, if you keep the grain separated until you serve, it makes reheating leftovers the next day a whole lot less mushy and the textures remain 'just so' throughout the eating of the meal.","meta":{"section":"Cooking","utc":"1328831195"}}
{"text":"Peauce. *** ^(Bleep-bloop, I'm a bot. This )^portmanteau ^( was created from the phrase 'Peanut sauce.'. To learn more about me, check out this )^FAQ.","meta":{"section":"Cooking","utc":1531889310}}
{"text":"A lot of non Americans don’t grow up eating it so the texture was really unfamiliar to me :)","meta":{"section":"Cooking","utc":1554467689}}
{"text":"Wish your boyfriend was my wife:/","meta":{"section":"Cooking","utc":1560784452}}
{"text":"Blue cheese is best","meta":{"section":"Cooking","utc":1561211575}}
{"text":"I'm pretty sure I have the newer model and having use all clad extensively (also having cooked professionally) they are rad.","meta":{"section":"Cooking","utc":"1386642963"}}
{"text":"Venison isn't all that temperamental actually. A brine and a sauté or a confit and you're in business just like with any other lean, game meat. Sure you get an even cook with sous vide but that's really the only benefit.","meta":{"section":"Cooking","utc":"1414820383"}}
{"text":"You can make a sage wreath. The color is gorgeous, muted and silvery.","meta":{"section":"Cooking","utc":1538370625}}
{"text":"I grew up eating heirloom tomatoes, my dad would always get a variety. I dont mind the yellow tomatoes, they're a little less acidic.","meta":{"section":"Cooking","utc":1564521728}}
{"text":"How hard is richlite on knives? Comparable to wood or is it a lot harder?","meta":{"section":"Cooking","utc":1480311107}}
{"text":"Paella/Risotto. One dish dinner and you throw in basically anything you like; veg, seafood, chicken, chorizo... Wanna recipe? I can give you my usual recipe if you like or hell, you can just google one cos it's nearly 1am over here and I just typed up 3 other recipes for my mates.","meta":{"section":"Cooking","utc":"1384044306"}}
{"text":"I love how this is a Taiwanese dish but you use simplified characters, haha. (For the uninitiated: Taiwan is AFAIK now the only diaspora location that uses traditional characters. Simplified was invented in the 50s by Mainland and is now taught in Mainland, HK, Malaysia, Singapore, US -- I'm sure this far from an exhaustive list.)","meta":{"section":"Cooking","utc":1547161016}}
{"text":"Okay, I realize Installment one was Insomiac baking, but who cares, everything I do in the kitchen involving food prep and cooking/baking is when I can't sleep. This is a fun one to share because it gets rid of leftovers and you can take one day whenever you run low and make a shit ton of these babies. 1. Get tortillas, I like to get multiple sizes, so, depending on how hungry the body attached to the hand grabbing it, it will be satisfied. 2. Get all your shit ready. I usually do this when we have a lot of leftovers that would freeze well, for instance, in this case, eggs, shredded cheese, corn, onions, frozen hashbrowns, pork al pastor, and rice with beans. And then I get crazy and buy a few more things shredded chicken for the enchilda sauce we bought on sale forever ago, roll of sausage on sale, some cheap ass bacon, refried beans. 3. I line up all the different goodies and mix and match, some get eggs and cheese, some beans and rice and eggs and bacon, whatever combinations I feel like until I run out of tortillas or ingredients. IMPORTANT: it is important to put something that will keep the burritos from drying out when cooking i.e. refriend beans, cheese (I put this on all of them for insurance), the chicken soaked in enchilada sauce. No one likes a dry buritto 4. Wrap all the little burritos and the big ass ones too in saran wrap, let cool a little if your ingredients went in hot (mine were not) and then stick em in the freezer. 5. You're hungry; burrito! Depending on the size; wrap in paper towel and micro anywhere from 1 to 2 minutes on each side. Great! Husband fed. And it's a burrito surprise everytime!","meta":{"section":"Cooking","utc":"1366357076"}}
{"text":"> (I use a lot of parsley) 100% this. If your falafel isn't a little bit green, you're not using enough herbs. [edit] Also, >stirring PRN, for a day or so Are you a pharmacist? [edit 2] for anyone wondering, **PRN** means \"as needed\" or \"whenever necessary\".","meta":{"section":"Cooking","utc":1540487977}}
{"text":"That makes sense. Can I thicken it with a cornstarch slurry after reducing by half? Or what else should I do to end up with a 'pan sauce' instead of a soup. I know I could use a lot less liquid, but then I'd have a lot less sauce.","meta":{"section":"Cooking","utc":1557840334}}
{"text":"Maybe too overdid the shallots and yes, a lot of mustard. Whole grain and dijon. Might cut one of the two out.","meta":{"section":"Cooking","utc":1522254459}}
{"text":"My wife.","meta":{"section":"Cooking","utc":1519053131}}
{"text":"I only use plastic cutting boards for meat to reduce contamination. Something about chicken juice seeping into my wood cutting board makes me feel uneasy.","meta":{"section":"Cooking","utc":"1388110956"}}
{"text":"Lol k.","meta":{"section":"Cooking","utc":1556935678}}
{"text":"I'm almost done eating at peoples houses who have pets. Dog hair in every fucking thing they make. It's like they don't notice! Oh cat jumps on the counter and you push them off? Now there's hair blowing around in our food..","meta":{"section":"Cooking","utc":1546626686}}
{"text":"Doing this with an egg on top. Yum!","meta":{"section":"Cooking","utc":"1422224319"}}
{"text":"I always expect to enjoy reading the most downvoted comment in the thread. Wow.","meta":{"section":"Cooking","utc":1560756474}}
{"text":"I like your attitude.","meta":{"section":"Cooking","utc":"1427773338"}}
{"text":"So many things about this comment made my day better. :) Thanks.","meta":{"section":"Cooking","utc":1455964071}}
{"text":"If you are willing to spend some time on dealing with fresh coconut, you can buy tons of it, deal with it (as in shredding it) and freeze it. Just make sure to squeeze out as much air as possible. However, if you aren't willing, try finding raw unsweetened coconut (like shredded or in flakes/chips).","meta":{"section":"Cooking","utc":1517172706}}
{"text":"somehow it must be injected into donuts! BaconCaramelDonutExplosion","meta":{"section":"Cooking","utc":"1339480410"}}
{"text":"Idk if Oklahoma counts as Midwest but I lived there for a bit. Small town, couldn't get any good food at all *except* tacos. Best ones I've ever eaten, and I could get those suckers for $1.50 a pop. I do miss that. Not that I'm refuting your experience! I've also lived in OH and I could see tacos and Mexican food being expensive there. OK was just close enough to Mexico for culinary bleed-over I think.","meta":{"section":"Cooking","utc":1558495729}}
{"text":"Sure","meta":{"section":"Cooking","utc":"1426268316"}}
{"text":"Bean soup with kale","meta":{"section":"Cooking","utc":"1353387688"}}
{"text":"As someone that loves to watch many cooking shows, I find David Chang to be the biggest piece of shit I've ever seen. He acts like he is open minded, but he is the most closed minded person I've ever seen. When someone says Fuck white people if they cook with kimchee because I was picked on as a kid...yea I'm not going to like a chef that PRETENDS to unite cultures. He goes on how oh I'm Korean and even Koreans don't like me etc...it's because you're just a dick and nobody likes you.","meta":{"section":"Cooking","utc":1521477187}}
{"text":"They're more or less all equal. You could also look at ceramic, which does actually sharpen / remove a little steel. The stainless ones are purely hones, which simply re-align the edge. Technically, they don't sharpen.","meta":{"section":"Cooking","utc":1474914708}}
{"text":"Personally I've never seen them in stores. Never eaten them. Didnt know they needed to be cooked so TIL.","meta":{"section":"Cooking","utc":1553223878}}
{"text":"I guess because I have never had a problem. I always heard whetstones are expensive, but I just checked amazon and most are under $100 US. I have a steel, so I am sure the issue with the angle on a whetstone wouldn't be a problem for me. I might give one a try.","meta":{"section":"Cooking","utc":"1429802557"}}
{"text":"That's a lot of money for a bird that lived a total of maybe 18 weeks.","meta":{"section":"Cooking","utc":"1392014352"}}
{"text":"Italian nachos. Focaccia crisps, shredded smoked provolone and aged mozzarella. Use bruschetta as a topping.","meta":{"section":"Cooking","utc":1563996832}}
{"text":"Pitch Potatoes","meta":{"section":"Cooking","utc":"1410787905"}}
{"text":"yum!","meta":{"section":"Cooking","utc":1517689822}}
{"text":"grill a few extra next time you grill and seal them in individual freezer bags (cook them less than your preference since they will cook a bit when you reheat them); then you can warm up in a skillet or microwave and still have the grilled taste","meta":{"section":"Cooking","utc":"1399578200"}}
{"text":"Thanks for rewording the OP, I almost didn't understand what he was saying when he asked 'what would happen if you low-and-slow a cut that you'd typically cook hot and fast'","meta":{"section":"Cooking","utc":"1413835344"}}
{"text":"lol, I guess that was sort of obvious, eh?","meta":{"section":"Cooking","utc":"1371662307"}}
{"text":"I've used a lot of methods to make the perfect mashed potato but nothing beats either a ricer and folding butter and milk in slowly or chopping up boiled potatoes and using m Kitchenaid stand mixer with the heavy whisk and going at it slow, allowing air to incorporate into the mixture for the perfect fluffy mashed potato. I once tried it with my stick blender thinking it wouldn't be like putting it in a blender. It was half alright and half goopy because of the broken starch.","meta":{"section":"Cooking","utc":1479524835}}
{"text":"Not EVOO - it burns really easily. Hot oils include sunflower, canola, or even avocado. Also don't get the pan so hot... get it very hot to the touch, add oil, heat gently for a minute and add the ingredients.. then turn the heat up to maximum and only stir once sizzling well. If you have a good non-direct heat source (i.e. gas, as opposed to electric) then this should stop it sticking while still browning well.","meta":{"section":"Cooking","utc":"1377267347"}}
{"text":"Are you me? I love all that.","meta":{"section":"Cooking","utc":1485061462}}
{"text":"When I was at this Japanese place in my hometown they offered a little bit of honey mustard with white rice and I have to say it was really good and maybe even a bit too sweet, but I really liked it!","meta":{"section":"Cooking","utc":1564449385}}
{"text":"It cant be onions!","meta":{"section":"Cooking","utc":1551180116}}
{"text":"He wont stop sugar in his coffee :( He won't lower his sugary carbs. He's such a nightmare.","meta":{"section":"Cooking","utc":1486761920}}
{"text":"Hmm I'll check out what they have here in Australia. I'm from America so I know like nothing haha","meta":{"section":"Cooking","utc":1530208010}}
{"text":"I used to have have food stick to stainless. However, I learned that I was heating the pan too hot. There is a Roixube video showing how to properly heat a pan.","meta":{"section":"Cooking","utc":"1334509914"}}
{"text":"Put some decnals on it dude, go for it","meta":{"section":"Cooking","utc":1483642740}}
{"text":"yeah sugar and soda are the cure for too much sour but go easy","meta":{"section":"Cooking","utc":1461332424}}
{"text":"Absolutely. The Trinity of the three ingredients work well enough that you really couldn't go wrong putting it in with just about anything. It's great in soups or stews, but like what I did above, I just threw it together with some meat and had a great home-cooked style dish with fresh ingredients.","meta":{"section":"Cooking","utc":"1374963042"}}
{"text":"The ultimate hot pocket.","meta":{"section":"Cooking","utc":"1364269475"}}
{"text":"Overcleaning cast iron.","meta":{"section":"Cooking","utc":1489975281}}
{"text":"Your friend was sold a pup: safflower instead of saffron. He wasn't the first and won't be the last to fall for that particular con trick. As you'll see from this excellent article, saffron is dried stamens and safflower is dried flower petals. Saffron, even when dried, has a structure whereas safflower looks a bit frayed. When you put whole saffron into hot water it gradually discolours the water a wonderful golden yellow-orange, and it has a special smell which is hard to describe. The colour kind of leaks from whole saffron threads. Powdered saffron immediately dyes the water but it's still a deep golden yellow-orange rather than red.","meta":{"section":"Cooking","utc":"1378583418"}}
{"text":"Hard to tell what's going wrong without knowing what recipe(s) you are using. The proper roux proportion is usually equal parts fat and flour by weight. If the recipe you used is not at least close to equal parts (Escoffier suggested an 8:9 fat to flour ratio), it likely has errors. When using butter, you need to remember that butter is only 80-85% fat, and make adjustments accordingly. Also, bread flour (higher gluten content) will make a thicker roux than AP flour (lower gluten content).","meta":{"section":"Cooking","utc":1492373108}}
{"text":"Haha as I've gotten older I've learned that people can fuck up just about anything. Always good to get recommendations in case someone had a bad experience with a particular brand.","meta":{"section":"Cooking","utc":"1447452018"}}
{"text":"just make sure the egg isn't in the shell. attempting to hard-\"boil\" an egg in the microwave will only end in tears and recriminations.","meta":{"section":"Cooking","utc":"1376948814"}}
{"text":">Let them show what they can do in their most comfortable areas. One of the reasons I liked beat Bobby Flay. Although I do like the idea of parameters being an equalizer to show fundamentals and creativity. I really Just like all kinds of cooking shows!","meta":{"section":"Cooking","utc":1555624872}}
{"text":"Are you shaking as it pops? That's a big part of it for me. Gotta make sure you shake so the unpopped kernels stay at the bottom on the heat otherwise you get popped kernels burning before some pop","meta":{"section":"Cooking","utc":1507580167}}
{"text":"This is only true for water (and liquids that are mostly made of water), where the more precise term would be \"fluid ounces\". For dry things, ounces is simply a unit of mass. 1 cup of flour will almost certainly never be 8 ounces.","meta":{"section":"Cooking","utc":1479267053}}
{"text":"I bet you'd never even notice in baked goods, which is what I use them for most. Thanks! I'm going to try that.","meta":{"section":"Cooking","utc":"1433531701"}}
{"text":"Huh. They've always been cheap until about 4-5 years ago. I think if you look in the grocers in neighborhoods populated by people from other cultures (Italians, Jamaicans, Cubans), you'll still find them very cheap. I've never seen them anywhere priced prohibitively expensive (but I realize that's probably a relative term). At Whole Foods, they do get a bit pricier. They've become very trendy at gastropubs and other foodie establishments in the past decade or so. Before that they were basically peasant food.","meta":{"section":"Cooking","utc":1483578162}}
{"text":"Maybe work with the sandiness of it, rather than against it? Add it to homemade granola, or to homemade crackers, where dry and sandy wouldn't be so bad, instead of trying to put it in soft baked goods?","meta":{"section":"Cooking","utc":1517782966}}
{"text":"They taste like dirt and sugar to me. Sweet dirt. I keep trying them juuuuuust in case (I'm pretty big on keeping an open mind about foods). But every time I try them... Yep. Dirt.","meta":{"section":"Cooking","utc":1554162316}}
{"text":"Everyone loves garlic, that would be a great addition","meta":{"section":"Cooking","utc":1515269432}}
{"text":"I have a gas oven if it makes any difference. The broiler in mine resembles a grill burner facing downward from the top of the oven with a piece of mesh steel over it to distribute the heat, if that makes any sense. Similar to this: https://atmedia.imgix.net/58df5abe84f7394d5f5e65e9f3e42036193aa78c?auto=format&amp;q=45&amp;w=540.0&amp;h=351.0&amp;fit=max&amp;cs=strip","meta":{"section":"Cooking","utc":1511970563}}
{"text":"Once the stock has reached boiling point, I turn it right down in order to simmer. Still gives me that awful boiled taste.","meta":{"section":"Cooking","utc":1517583460}}
{"text":"I love the flavor that onions add to foods, but for some reason I just do not like raw onions. Same goes for mushrooms.","meta":{"section":"Cooking","utc":"1336869213"}}
{"text":"What do you want to cook? If you want to make predominantly pizza, then I'd suggest getting an Ooni Koda and then building a separate smoker. When you move, you'll be able to take the Koda with you, and the lower temp cooking of the smoker gives you a far easier, far more portable build. If you want to make breads or large roasts, then something like this could be taken down when you move: https://www.reddit.com/r/Pizza/comments/8g6iti/biweekly_questions_thread/dyaq380/ and you could, in theory, incorporate an offset fire chamber to the side, but, it's not ideal for pizza, if you get it wet, it will take hours of labor to dry it out and make it saffe for baking, and the raw materials, on their own, are more expensive than a koda and a DIY smoker.","meta":{"section":"Cooking","utc":1564140565}}
{"text":"Broccoli salad. I live an hour away from work. I prep it the night before. Actually I usually get my wife to make it as her broccoli salad is amazing. Having it sit overnight makes it even better. Depending on audience I'll modifying it with no bacon, but typically bacon makes it. Raisins, bacon, red onions, sunflower seeds, vinegar/mayo base, with some amount of sugar. Bacon....cheese, and broccoli. Probably other things I'm missing. If you want the recipe I could get it from my wife! *edit* Broccoli salad recipe... > 2 parts mayo to one part vinegar and sugar (ie: ½ cup mayo ¼ cup vinegar, ¼ cup sugar [I use brown sugar, because it adds depth to the sauce]); mix until it reaches a smooth consistency > (use as much of the above mentioned dressing as you like, however one total cup (of all three parts combined) generally suffices for the amount of salad that is listed below > 4 cups broccoli heads; chopped to bite-sized pieces > 5 strips bacon; cooked and crumbled > 1/3 cup lightly toasted sunflower seeds (I always buy the raw ones and toast them myself, because they are a fraction of the price and they retain their nutrients and flavor the best when toasted fresh) > 1/3 cup raisins (I always use the green ones for a contrast in flavor to the sweet dressing) > cheese, add to your liking and use what you prefer > 1/3 cup red onions, minced > Mix dressing, chop broccoli and add together. Then add the rest of the items to the broccoli and dressing and mix it all together. Add a pinch of salt, mix again. Let the dressing soak into to the salad while refrigerating (at least 4 hours, but overnight is best). Flip the salad into another bowl once it’s set and you’re done. You can also add walnuts (toasted) to the recipe, which is awesome.","meta":{"section":"Cooking","utc":"1421274993"}}
{"text":"Yeah, it's nice. I mostly wish it used decimal places with ounces instead of fractions, but that's way more forgivable at the new price than the old.","meta":{"section":"Cooking","utc":1545023175}}
{"text":"I'm like that with boiled eggs. I have immediate gag reflex when I bite into one. When my mom made a salad and added eggs I just swallowed it without chewing.","meta":{"section":"Cooking","utc":1546205236}}
{"text":"Thanks! Great word :)","meta":{"section":"Cooking","utc":"1355592560"}}
{"text":"Tuna meltssssss","meta":{"section":"Cooking","utc":1528911417}}
{"text":"Just posted everything in the comments.","meta":{"section":"Cooking","utc":"1384042170"}}
{"text":"Pre-cook everything, because folks topping their own pizzas tend to overload them, leading to a lot of wet and undercooked toppings. Folks feel indulged if there are a lot of topping choices, including ones they have not tried before, so scout out some things that you will enjoy as left overs to flesh out the topping choices. By way of example, I offer quartered artichoke hearts, roasted red peppers, capers and sliced scallions as 4 separate topping options, because I make a killer salad with those ingredients and can just store them together after the party for a day or two until I can fit the salad into my regular rotation. Chopped fried bacon is another topping I always offer, because I know that in any given meal, I can put leftovers to good use; the same is true of whole garlic cloves roasted in olive oil. ... and use fresh mushrooms, sliced and sauteed until lightly brown in olive oil or butter as to your taste.","meta":{"section":"Cooking","utc":1517020786}}
{"text":"I also posted it to /r/pizza and there was similar outrage, but less so. I don't know if there is an authoritative voice though? Lot's of countries do pizza differently. I suppose one might think Italy, but I did a 21 pizza tour throughout Italy in 2011 and while I ate some amazing pies, I would say overall I prefer American pizza. This even includes the Neapolitan. I like eating pizza that has a lot of cheese and is sliced. &amp;#x200B; I think the problem of including pizza marinara is that if you eliminate the cheese component, now the requirements are flat dough with sauce... So a flatbread with alfredo sauce, buffalo sauce, or garlic sauce is now pizza? Seems more like breadsticks or a flatbread that you just haven't sliced where you baked the dipping sauce with the dough instead of dipping after. I read the wiki and laughed about how it was usually only eaten by poor sailors. So yeah in the 18th century with no electric refrigeration this would qualify as pizza, but I don't think it deserves to be included in the 21st cent definition .","meta":{"section":"Cooking","utc":1535226950}}
{"text":"Perfectly serene. Wine can be a number of things - red, white, rosé (yet to see this as a vinegar, tbh) and fortified - so the adjective is warranted.","meta":{"section":"Cooking","utc":"1443117687"}}
{"text":"Citrus Salt","meta":{"section":"Cooking","utc":"1354302003"}}
{"text":"My brother thinks he invented both the grilled cheese (called \"a cheesy toasty\") and the quesadilla (\"cheesio toastio,\" obviously). He never ate either when we were kids because he didn't like cheese (the fool), but since discovering a love of cheese as an adult, he claims he \"invented\" both... He's not an idiot, so yes, he's mostly kidding and had obviously heard of both dishes before, but he does consistently use his own names for them now. I approve.","meta":{"section":"Cooking","utc":"1329460592"}}
{"text":"Beef stew","meta":{"section":"Cooking","utc":1537798023}}
{"text":"Do you have a dutch oven? I'm thinking it's going to be a nightmare trying to control the temp and a dutch oven should help with that.","meta":{"section":"Cooking","utc":"1393272917"}}
{"text":"Just. Eat. Like. A. Mexican. For fucks sake corn is a naturally low gluten source, just use corn tortillas and shit. Why imitate things with originally a fuckload of gluten just to ruin it?","meta":{"section":"Cooking","utc":1529093272}}
{"text":"I really just wanted to share what my friend and I had made, not start a food fight!","meta":{"section":"Cooking","utc":"1337470524"}}
{"text":"if you keep them in the fridge they would not spoil so easily","meta":{"section":"Cooking","utc":"1434793500"}}
{"text":"Whatever you just described, I want it.","meta":{"section":"Cooking","utc":"1423713094"}}
{"text":"Yay! They look great, nice work and keep going 😁","meta":{"section":"Cooking","utc":1550566087}}
{"text":"I'm still alive.","meta":{"section":"Cooking","utc":1553277244}}
{"text":"Specifially what kind of leftovers? This matters","meta":{"section":"Cooking","utc":1501069835}}
{"text":"The ingredient that puts my guac over the edge-- corn. For every two avocados, I boil one ear of corn, slice off the cooked kernels and throw them in once they cool. That texture and sweetness make it special. And, yes, I also add tomatoes to my guac. In addition to onion, garlic, jalapeño, salt &amp; pepper. I'm one of those people who hate cilantro so I keep it out my recipe. Cilantro lovers still praise my guac.","meta":{"section":"Cooking","utc":"1407733017"}}
{"text":"If you're doing it this way, it also helps to take out the pasta when its just slightly shy of al-dente, and let it finish in the sauce. My sauce is typically already thick so my technique is to just quickly scoop the noodles out of the water and into the sauce with either a strainer or tongs (as opposed to draining it), which allows just enough water to come along to add that bit of starch you need.","meta":{"section":"Cooking","utc":1451846588}}
{"text":"This except if you threw it into a pan that was too hot it might not ever release","meta":{"section":"Cooking","utc":1544904766}}
{"text":"Yeah, who knows. My friend had brain surgery and was home in three days. They said it was safer at home than in the hospital with all the germs. She returned to the psychiatric ward a day later to recover. *shrug*","meta":{"section":"Cooking","utc":1502411068}}
{"text":"I dice it up with watermelon and toss it with finely chopped peppermint and feta cheese crumbles. Super refreshing and a different twist on a salad that's great for a summer picnic.","meta":{"section":"Cooking","utc":"1374271614"}}
{"text":"Celery salt - cumin - paprika","meta":{"section":"Cooking","utc":"1435214783"}}
{"text":"I think I was making molasses cookies at the time, and melting sugar for something else, and the vinegar ended up in the pan with the sugar somehow.","meta":{"section":"Cooking","utc":1528317335}}
{"text":"first time poster, long time looker of foods. coming to this from /r/trees and i gotta say...am i the only one who sees a t-rex about to munch on some asparagus?","meta":{"section":"Cooking","utc":"1366686282"}}
{"text":"Local and organic are different things with different advantages and disadvantages, although food can be both local and organic. Also kungfoojesus is spouting a bunch of pigshit. The USDA organic label is regulated, and the admittedly large amount of misinformation about the benefits of organic food can't really be attributed to any single \"movement.\"","meta":{"section":"Cooking","utc":"1334332642"}}
{"text":"The thing I suggest is: don't order stuff you make at home. If you're reasonably good at cooking, the dish you create will most of the time be more to your taste and/or cheaper. There isn't really anything a restaurant could do about that. But try new stuff, combinations you wouldn't expect to work together, dishes that require to much effort to make yourself or dishes with ingredients that are hard to get in your area. Those are the meals I enjoy the most when eating out.","meta":{"section":"Cooking","utc":1459533518}}
{"text":"Intersting. Does that work to cook corn tortillas or just to warm flour ones?","meta":{"section":"Cooking","utc":1525750836}}
{"text":"Your answer gives me hope!!! Thank you!","meta":{"section":"Cooking","utc":"1434418546"}}
{"text":"the only white wine sauce i have made (from memory): 2 tbs unsalted butter 1 tbs all purpose flour 1.5 cups wine 1 garlic clove chives salt pepper combine butter and garlic in medium heat pan. when melted, whisk in flour. cook for about a minute. add wine and bring to a boil. reduce to a simmer, cover, and reduce to 1/2 original volume. add chives to taste and season with salt and pepper.","meta":{"section":"Cooking","utc":"1355864836"}}
{"text":"How did you not notice the frying pan in there when you put the pizza in?","meta":{"section":"Cooking","utc":1533256043}}
{"text":"What a great gift! Yep, pasta or risotto, or both! The easiest way I've done risotto in in a pressure cooker, like this recipe. You think it's too easy to turn out great, but it will.","meta":{"section":"Cooking","utc":1545954657}}
{"text":"there is nothing better: http://everydayrussian.com/?p=77","meta":{"section":"Cooking","utc":1485067595}}
{"text":"Go to your local restaurant supply store and buy yourself a knife. Find one you like the feel of. It shouldn't cost more than $30 for an 8\" or 10\". Learn to take care of it in at least a cursory way.","meta":{"section":"Cooking","utc":"1356823024"}}
{"text":"Pretty much all cold fruit is awesome on a summer day. Watermelon, grapes, apples, oranges. Cut them and freeze and put in your juice and hop in the pool. Yeah 😎","meta":{"section":"Cooking","utc":1507161131}}
{"text":"You don't have to believe all the shit you read online about having to sacrifice virgins while seasoning your cast iron. Just use it. Cook with plenty of oil until you get it broken in &amp; don't clean it *too* much.","meta":{"section":"Cooking","utc":"1443938318"}}
{"text":"Did somebody say lasagna?","meta":{"section":"Cooking","utc":1494001520}}
{"text":"Lasagne is always a big hit.","meta":{"section":"Cooking","utc":1553689304}}
{"text":"I cook some ground beef in El Paso taco seasoning and salsa and make nachos. Plus you get ground beef for the rest of the week.","meta":{"section":"Cooking","utc":1449254129}}
{"text":"Make a jar filled with dressing or mayo and pack a head of lettuce. Break of leaves as you eat and dip into dressing/mayo. You now have a salad edible by hand. Roast chicken is a winner as already suggested. If you don't mind the prep, you can shred the whole thing and bring it in a container. I like bringing wraps/tortillas along. Then you can just fill on the spot with other veggies, etc. A whole cob loaf sandwich is sturdy and holds well. I was going to suggest quiche (but I saw the egg allergy comment!). You could make cake/biscuit sandwiches with jam sandwiched inbetween. That way you don't lose anything filling when you pack it.","meta":{"section":"Cooking","utc":"1395980043"}}
{"text":"Wow this looks so good. Gotta start the grill.","meta":{"section":"Cooking","utc":1465363991}}
{"text":"Speak for yourself","meta":{"section":"Cooking","utc":1551660841}}
{"text":"I would defrost them and rinse them, ensuring they are all at the same level of thaw. Otherwise, they will cook unevenly and you will have some overdone and some underdone","meta":{"section":"Cooking","utc":1521298449}}
{"text":"Check your local weekly ads. Tomatoes may be on sale. Make a whole car-full...lol","meta":{"section":"Cooking","utc":"1325546523"}}
{"text":"The rotisserie chicken ceaser wrap sounds delicious!","meta":{"section":"Cooking","utc":1471319816}}
{"text":"I've never eaten meat in my life and I'm always content if there are enough vegetable sides. If the stuffing and gravy can both be made vegetarian, that's a big plus. That green bean casserole that Americans love (strangely it is not much of a thing here in Canada) is really delicious if not made from tinned soup but from fresh ingredients. The Cook's Illustrated recipe is solid (just use veg broth instead of chicken). It's Thanksgiving-ish and reasonably hearty. In re. \"I would like some main dishes though that we could all possibly enjoy\" -- sometimes it can be frustrating for vegetarians to sit down to a meal and discover that all they can eat is an uninspired salad and some dinner rolls. That blows. But at a big holiday feast I think most of us are totally fine with having something like a slew of roasted veg be our main dish. Omnivores tend to get stuck on the idea that there must be a main dish and it must be protein; vegetarians I've known are fine with, well, green bean casserole as a 'main dish.' Meat/protein is supposed to be a small part of the plate, and it is in many cultures.","meta":{"section":"Cooking","utc":"1447780189"}}
{"text":"For hot fast meat go with any rib cut, sirloin, flat iron, flap meat (names change by area). The only round I would use is top, often sold as London Broil. Tenderloin would be wasted, chuck is for low and slow.","meta":{"section":"Cooking","utc":"1369971280"}}
{"text":"I appreciate you trying to be helpful, but this is exactly the type of response that annoys me. The cooking time for that recipe is 5 to 6 hours...","meta":{"section":"Cooking","utc":1501003156}}
{"text":"If its blue at full throttle, then its getting enough air. The orange is cos of hot metal. Nbd.","meta":{"section":"Cooking","utc":1455102761}}
{"text":"Just make a garlic+olive oil+butter sauce and you will love any veggie in the world :D","meta":{"section":"Cooking","utc":"1433155757"}}
{"text":"Her appeal was, no longer there I think, the attainable attractive girl next door look. Her food was horrible and from memory a lot of it appeared burnt rather than cooked.","meta":{"section":"Cooking","utc":1534332248}}
{"text":"Good luck removing the enamel, but yes, you could.","meta":{"section":"Cooking","utc":"1330299012"}}
{"text":"As an ignorant but curious American, what is the difference between 'noodle' and 'pasta'? I always thought noodle was the umbrella term, and pasta referred to Italian varieties (versus German or Japanese or what have you).","meta":{"section":"Cooking","utc":"1353290724"}}
{"text":"make pasta sauce, or chili, or roast a few at a time and eat as sides. I always love roasted tomato on the plate when I eat red meat.","meta":{"section":"Cooking","utc":1555413847}}
{"text":"Please give this a try: Easy Carnitas. One of my housemates found this on Reddit a few months ago. It's a ridiculously easy recipe and it's honestly one of the tastiest dishes I have ever had. The last batch I made lasted me two weeks. I'd recommend cooking quantities per the instructions and freezing at least half. So damn good.","meta":{"section":"Cooking","utc":"1328855863"}}
